anton-vinogradov/esp32-leshy/src/main.cpp
static int  curMenu() { return menuStack[depth]; }
static int& curSel()  { return selStack[depth]; }
// In a menu the radios are idle — scanning only runs on a scan screen.
static void showMenu() { engine.pause(); st = ST_MENU; menuScreen.show(&MENUS[curMenu()], curSel(), depth > 0); drawNetBadge(); }

static void saveLang(Lang l) { Preferences p; p.begin("leshy", false); p.putUChar("lang", (uint8_t)l); p.end(); }
static Lang loadLang() { Preferences p; p.begin("leshy", true); uint8_t v = p.getUChar("lang", (uint8_t)UI_LANG); p.end(); return (Lang)v; }

static int  listCount() { return st == ST_WIFI ? engine.wifiCount() : engine.bleCount(); }
static void drawList(bool full) {
    if (st == ST_WIFI) { if (full) wifiScreen.draw(engine, off, wifiSel); else wifiScreen.rows(engine, off, wifiSel); }
    else               { if (full) bleScreen.draw(engine, off);  else bleScreen.rows(engine, off); }
}

static void drawInfo() {
    uiHeaderRu(infoTitle.c_str());
    tft.fillRect(0, 28, 240, 320 - 28, uiBg());
    fontSmall();
    tft.setTextDatum(TL_DATUM);
    tft.setTextColor(tft.color565(0xe8, 0xe8, 0xe0), uiBg());
    int y = drawWrapped(infoBody.c_str(), 10, 50, 220, 24, 3);   // word-wrap, no mid-word breaks
    if (infoNote.length()) {
        tft.setTextColor(tft.color565(0xff, 0xcf, 0x3f), uiBg());
        drawWrapped(infoNote.c_str(), 10, y + 14, 220, 24, 7);
    }
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back",
               infoAction >= 0 ? (i18n::isRu() ? "менять ▶" : "change ▶") : nullptr);
    fontOff();
    drawNetBadge();
}

// Adjustable-setting info screens: show the CURRENT value; SELECT/RIGHT cycles in place.
static void drawLedsInfo() {
    uint8_t b = leds.brightness();
    infoTitle = i18n::tr("Status LEDs", "Светодиоды");
    infoBody  = b ? String(i18n::tr("Brightness ", "Яркость ")) + b + "/255"
                  : String(i18n::tr("Off", "Выключены"));
    infoNote  = i18n::tr("Press ▶ to change. LEDs under the antennas show what the radio is doing.",
                         "Жми ▶ для смены. Светодиоды под антеннами показывают работу радио.");
    infoAction = F_LEDS; st = ST_INFO; drawInfo();
}
static void drawBacklightInfo() {
    uint8_t v = uiBacklightLevel();
    infoTitle = i18n::tr("Screen light", "Яркость экрана");
    infoBody  = String(v * 100 / 255) + "%";
    infoNote  = i18n::tr("Press ▶ to change the screen brightness.",
                         "Жми ▶ для смены яркости экрана.");
    infoAction = F_BACKLIGHT; st = ST_INFO; drawInfo();
}

// TX radiation power for the Spectrum noise self-test — persisted; applied to the NRF24.
static void saveTxPower(uint8_t bits) { Preferences p; p.begin("leshy", false); p.putUChar("tx_pwr", bits); p.end(); }
static uint8_t loadTxPower() { Preferences p; p.begin("leshy", true); uint8_t v = p.getUChar("tx_pwr", 0x06); p.end(); return v & 0x06; }

static uint8_t txPowerCycle() {              // 0 dBm (max) -> -6 -> -12 -> -18 -> wrap; persists; applied to radio
    uint8_t b = nrf.txPower();
    b = (b == 0) ? 0x06 : (uint8_t)(b - 2);
    nrf.setTxPower(b);
    saveTxPower(b);
    return b;
}

static void drawTxPowerInfo() {
    uint8_t b = nrf.txPower();
    int dbm = Nrf24Spectrum::txPowerDbm(b);
    infoTitle = i18n::tr("TX power", "Мощность TX");
    infoBody  = String(dbm) + i18n::tr(" dBm", " дБм") + (b == 0x06 ? i18n::tr(" (max)", " (макс)") : "");
    infoNote  = i18n::tr("Transmit power for the Generator test. Max = loudest, but can wash out the whole waterfall — lower it for a cleaner picture.",
                         "Мощность передачи в тесте Генератора. Максимум — громче, но может засветить весь водопад — снизь для чистой картинки.");
    infoAction = F_TXPOWER; st = ST_INFO; drawInfo();
}

// TX mode: Проверка (keep one antenna listening → live waterfall) vs Максимум (all antennas
// transmit → louder, waterfall goes dark). Persisted; applied to the NRF24.
static void saveTxMode(bool listenSelf) { Preferences p; p.begin("leshy", false); p.putBool("tx_self", listenSelf); p.end(); }
static bool loadTxMode() { Preferences p; p.begin("leshy", true); bool v = p.getBool("tx_self", true); p.end(); return v; }

static bool txModeCycle() {                  // toggle Проверка <-> Максимум; persists; applied to radio
    bool v = !nrf.txListenSelf();
    nrf.setTxListenSelf(v);
    saveTxMode(v);
    return v;
}

static void drawTxModeInfo() {
    bool self = nrf.txListenSelf();
    infoTitle = i18n::tr("TX mode", "Режим передачи");
    infoBody  = self ? i18n::tr("Verify", "Проверка") : i18n::tr("Maximum", "Максимум");
    infoNote  = self ? i18n::tr("One antenna keeps listening — you see the injected signal on the waterfall. Best for checking it works.",
                                "Одна антенна слушает — свой сигнал виден на водопаде. Для проверки, что всё работает.")
                     : i18n::tr("All antennas transmit — loudest output, but the waterfall goes dark (nothing is left to receive).",
                                "Все антенны в эфир — максимум мощности, но водопад гаснет (принимать нечем).");
    infoAction = F_TXMODE; st = ST_INFO; drawInfo();
}

static void drawProvisionScreen() {
    const uint16_t bg = uiBg();
    const uint16_t white = tft.color565(0xe8, 0xe8, 0xe0);
    const uint16_t gold  = tft.color565(0xe7, 0xcf, 0x8f);
    uiHeaderRu(i18n::tr("Wi-Fi setup", "Настройка Wi-Fi"));
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    tft.setTextDatum(TL_DATUM);
    fontSmall(); tft.setTextColor(white, bg);
    tft.drawString(i18n::tr("1. Join Wi-Fi:", "1. Подключись к Wi-Fi:"), 10, 46);
    fontBig();   tft.setTextColor(gold, bg);
    tft.drawString(NetManager::apName(), 10, 68);
    fontSmall(); tft.setTextColor(white, bg);
    tft.drawString(i18n::tr("2. Open in browser:", "2. Открой в браузере:"), 10, 112);
    fontBig();   tft.setTextColor(gold, bg);
    tft.drawString("192.168.4.1", 10, 134);
    fontSmall(); tft.setTextColor(white, bg);
    tft.drawString(i18n::tr("3. Pick network + password", "3. Выбери сеть + пароль"), 10, 178);
    uiFooterRu(i18n::tr("◀ cancel", "◀ отмена"));
    fontOff();
}

// Lab captive-portal demo: our own named AP asks a visitor to lower their TX power;
// a tap on the page registers here and drops the AP. Own-equipment demo — no
// credentials asked or stored (see PolitePortal).
static int  politePhase = 0;                       // last drawn phase: 0 waiting · 1 done · 2 stopped
static bool portalSetup = false;                   // true = setup (name form) screen; false = raise (consent) screen
static bool portalSaved = false;                   // setup: the name was saved

static void drawPoliteScreen() {
    const uint16_t bg = uiBg();
    const uint16_t white = tft.color565(0xe8, 0xe8, 0xe0);
    const uint16_t gold  = tft.color565(0xe7, 0xcf, 0x8f);
    const uint16_t green = tft.color565(0x3f, 0xe0, 0x7a);
    uiHeaderRu(portalSetup ? i18n::tr("Portal setup", "Настройка портала")
                           : i18n::tr("Captive portal", "Captive-портал"));
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    tft.setTextDatum(TL_DATUM);
    fontSmall(); tft.setTextColor(white, bg);
    tft.drawString(i18n::tr("1. Join this Wi-Fi:", "1. Подключись к сети:"), 10, 46);
    tft.setTextColor(gold, bg);
    tft.drawString(portal.ssid(), 10, 70);
    tft.setTextColor(white, bg);
    tft.drawString(portalSetup ? i18n::tr("2. Type the name, save.", "2. Впиши имя точки, сохрани.")
                               : i18n::tr("2. A page opens on the phone.", "2. На телефоне откроется страница."), 10, 104);
    fontBig();
    if (!portal.isRunning()) {                     // auto-stopped after the action (or begin failed)
        tft.setTextColor(green, bg);
        tft.drawString(i18n::tr("Done - AP is off.", "Готово — точка выкл."), 10, 150);
        fontSmall(); tft.setTextColor(white, bg);
        tft.drawString(i18n::tr("Press back.", "Нажми назад."), 10, 186);
    } else if (portalSetup ? portalSaved : portal.consented()) {
        tft.setTextColor(green, bg);
        tft.drawString(portalSetup ? i18n::tr("Name saved!", "Имя сохранено!") : i18n::tr("Consent got!", "Согласие!"), 10, 150);
        fontSmall(); tft.setTextColor(white, bg);
        tft.drawString(i18n::tr("Shutting down...", "Закрываюсь…"), 10, 186);
    } else {
        tft.setTextColor(gold, bg);
        tft.drawString(portalSetup ? i18n::tr("Awaiting name...", "Жду имя…") : i18n::tr("Waiting...", "Ждём гостя…"), 10, 150);
        fontSmall(); tft.setTextColor(white, bg);
        tft.drawString(portalSetup ? i18n::tr("Fill the form on the phone.", "Заполни форму на телефоне.")
                                   : i18n::tr("Tap the button on the page.", "Жми кнопку на странице."), 10, 186);
    }
    uiFooterRu(i18n::tr("◀ back", "◀ назад"));
    fontOff();
}

// Small "connected" mark in the top-right of the header: three gold bars, drawn
// only while actually associated. Scanning drops the link, so it honestly
// disappears on the scan screens.
static void drawNetBadge() {
    bool conn = net.connected();
    bool upd  = (ota.phase() == OtaManager::AVAILABLE);
    if (!conn && !upd) return;
    if (upd) {                                   // amber up-arrow: an update is waiting
        const uint16_t amber = tft.color565(0xff, 0xa5, 0x2a);
        tft.fillTriangle(190, 8, 184, 20, 196, 20, amber);
        tft.fillRect(187, 18, 6, 4, amber);
    }
    if (conn) {                                  // gold signal bars: connected
        const uint16_t gold = tft.color565(0xff, 0xcf, 0x3f);
        int x = 210, base = 21;
        tft.fillRect(x,      base - 6,  4, 6,  gold);
        tft.fillRect(x + 6,  base - 10, 4, 10, gold);
        tft.fillRect(x + 12, base - 14, 4, 14, gold);
    }
}

// ---- hidden (revealed) SSID list ----
static const int HID_TOP = 40, HID_ROW_H = 30, HID_VISIBLE = 8;
static int hidSel = 0, hidOff = 0, hidRowY[HID_VISIBLE];

// One list row, repainted in place (fills only its own rectangle — no full-screen clear).
static void drawHiddenRow(int slot) {
    fontOff();                    // rows use the built-in fonts (2/1); drop any smooth font first
    const uint16_t bg = uiBg();
    const uint16_t white = tft.color565(0xe8, 0xe8, 0xe0);
    const uint16_t gold  = tft.color565(0xff, 0xcf, 0x3f);
    const uint16_t dim   = tft.color565(0x8f, 0xa9, 0x8f);
    int n   = revealer.count();
    int idx = hidOff + slot;
    int y   = HID_TOP + slot * HID_ROW_H;
    hidRowY[slot] = (idx < n) ? y : -1;
    tft.fillRect(0, y, 240, HID_ROW_H, bg);
    if (idx >= n) return;
    uint8_t b[6]; String ss;
    revealer.get(idx, b, ss);
    bool sel = (idx == hidSel);
    uint16_t rowbg = sel ? tft.color565(0x22, 0x33, 0x22) : bg;
    if (sel) tft.fillRoundRect(6, y, 228, HID_ROW_H - 4, 6, rowbg);
    if (ss.length() > 18) ss = ss.substring(0, 17) + "~";
    tft.setTextDatum(TL_DATUM);
    tft.setTextColor(sel ? gold : white, rowbg);
    tft.drawString(ss, 12, y + 1, 2);
    char mac[18];
    snprintf(mac, sizeof(mac), "%02X:%02X:%02X:%02X:%02X:%02X", b[0], b[1], b[2], b[3], b[4], b[5]);
    tft.setTextColor(dim, rowbg);
    tft.drawString(mac, 12, y + 16, 1);
}

static void clampHidden() {
    int n = revealer.count();
    if (hidSel > n - 1) hidSel = n - 1;
    if (hidSel < 0) hidSel = 0;
    if (hidSel < hidOff) hidOff = hidSel;                      // stop when the screen would start to empty
    if (hidSel >= hidOff + HID_VISIBLE) hidOff = hidSel - HID_VISIBLE + 1;
    if (hidOff < 0) hidOff = 0;
}

