anton-vinogradov/esp32-leshy/src/main.cpp
static const char* otaErrText(OtaManager::Err e) {
    switch (e) {
        case OtaManager::E_NONET:     return i18n::tr("No network",        "Нет сети");
        case OtaManager::E_TIME:      return i18n::tr("No clock (SNTP)",   "Нет времени");
        case OtaManager::E_API:       return i18n::tr("Server error",      "Ошибка сервера");
        case OtaManager::E_NORELEASE: return i18n::tr("No releases yet",   "Релизов пока нет");
        case OtaManager::E_RATELIMIT: return i18n::tr("Rate limited",      "Лимит запросов");
        case OtaManager::E_PARSE:     return i18n::tr("Bad response",      "Плохой ответ");
        case OtaManager::E_NOASSET:   return i18n::tr("No firmware.bin",   "Нет firmware.bin");
        case OtaManager::E_HTTP:      return i18n::tr("Download error",    "Ошибка загрузки");
        case OtaManager::E_BEGIN:     return i18n::tr("No OTA slot",       "Нет OTA-слота");
        case OtaManager::E_WRITE:     return i18n::tr("Flash error",       "Ошибка записи");
        case OtaManager::E_SHORT:     return i18n::tr("Interrupted",       "Прервано");
        case OtaManager::E_HASH:      return i18n::tr("Checksum mismatch", "Хеш не сошёлся");
        case OtaManager::E_END:       return i18n::tr("Bad image",         "Битый образ");
        case OtaManager::E_NOMEM:     return i18n::tr("Low memory",        "Мало памяти");
        default:                      return "";
    }
}

// A short "what to do" hint per error — the actionable half of a full-screen error.
static const char* otaHintText(OtaManager::Err e) {
    switch (e) {
        case OtaManager::E_NONET:     return i18n::tr("Join your Wi-Fi in Connection, then retry.", "Подключись к своему Wi-Fi в «Подключении» и повтори.");
        case OtaManager::E_TIME:      return i18n::tr("The clock needs internet. Wait a bit and retry.", "Часам нужен интернет. Подожди немного и повтори.");
        case OtaManager::E_API:       return i18n::tr("No answer from GitHub. Retry; if it persists, check the net.", "Нет ответа от GitHub. Повтори; если не поможет — проверь сеть.");
        case OtaManager::E_NORELEASE: return i18n::tr("No release has been published yet.", "Релиз ещё не опубликован.");
        case OtaManager::E_RATELIMIT: return i18n::tr("GitHub rate limit. Wait about an hour.", "Лимит запросов GitHub. Подожди примерно час.");
        case OtaManager::E_PARSE:     return i18n::tr("GitHub sent an unreadable reply. Retry.", "GitHub прислал нечитаемый ответ. Повтори.");
        case OtaManager::E_NOASSET:   return i18n::tr("The release has no firmware.bin file.", "В релизе нет файла firmware.bin.");
        case OtaManager::E_HTTP:      return i18n::tr("Download failed. Check the net and retry.", "Загрузка не удалась. Проверь сеть и повтори.");
        case OtaManager::E_BEGIN:     return i18n::tr("No room for the update image.", "Нет места под образ обновления.");
        case OtaManager::E_WRITE:     return i18n::tr("Flash write failed. Retry.", "Сбой записи во флеш-память. Повтори.");
        case OtaManager::E_SHORT:     return i18n::tr("The download was cut off. Retry.", "Загрузка оборвалась. Повтори.");
        case OtaManager::E_HASH:      return i18n::tr("Checksum mismatch — the file is corrupt. Retry.", "Хеш не сошёлся — файл повреждён. Повтори.");
        case OtaManager::E_END:       return i18n::tr("The image was rejected. Retry.", "Образ отвергнут системой. Повтори.");
        case OtaManager::E_NOMEM:     return i18n::tr("Not enough RAM. Reboot the device and retry.", "Не хватило памяти. Перезагрузи устройство и повтори.");
        default:                      return "";
    }
}

// Word-wrap a string at maxw px (font must already be loaded, datum TL, color set). Returns next y.
static int drawWrapped(const char* s, int x, int y, int maxw, int lh, int maxlines) {
    char line[160] = {0}; char word[80]; char trial[200];
    int lines = 0;
    const char* w = s;
    while (*w && lines < maxlines) {
        while (*w == ' ') w++;
        int wi = 0;
        while (*w && *w != ' ' && wi < (int)sizeof(word) - 1) word[wi++] = *w++;
        word[wi] = 0;
        if (!wi) break;
        if (line[0]) snprintf(trial, sizeof(trial), "%s %s", line, word);
        else         snprintf(trial, sizeof(trial), "%s", word);
        if (tft.textWidth(trial) <= maxw) {
            strncpy(line, trial, sizeof(line) - 1);
        } else {
            if (line[0]) { tft.drawString(line, x, y); y += lh; lines++; strncpy(line, word, sizeof(line) - 1); }
            else         { tft.drawString(word, x, y); y += lh; lines++; line[0] = 0; }
        }
    }
    if (line[0] && lines < maxlines) { tft.drawString(line, x, y); y += lh; }
    return y;
}

// Full-screen, photographable error — big reason, plain-language hint, and the exact
// technical facts (stage / HTTP code / detail) so a photo is enough to diagnose it.
static void drawOtaError() {
    const uint16_t bg    = tft.color565(0x1c, 0x0c, 0x0c);
    const uint16_t hdrbg = tft.color565(0x86, 0x22, 0x22);
    const uint16_t panel = tft.color565(0x2a, 0x16, 0x16);
    const uint16_t white = tft.color565(0xf4, 0xea, 0xea);
    const uint16_t dim   = tft.color565(0xcf, 0xa2, 0xa2);
    const uint16_t label = tft.color565(0x9a, 0x78, 0x78);
    const uint16_t gold  = tft.color565(0xff, 0xd0, 0x55);
    tft.fillScreen(bg);
    tft.fillRect(0, 0, 240, 28, hdrbg);
    fontBig(); tft.setTextDatum(ML_DATUM); tft.setTextColor(white, hdrbg);
    tft.drawString(i18n::tr("Update error", "Ошибка обновления"), 8, 15);

    fontBig(); tft.setTextDatum(TL_DATUM); tft.setTextColor(gold, bg);
    tft.drawString(otaErrText(ota.err()), 12, 40);

    fontSmall(); tft.setTextColor(white, bg);
    int y = drawWrapped(otaHintText(ota.err()), 12, 72, 216, 20, 3) + 8;

    tft.fillRoundRect(6, y, 228, 300 - y, 8, panel);
    int ty = y + 10, tx = 14;
    char buf[80];
    fontSmall();
    tft.setTextColor(label, panel); tft.drawString(i18n::tr("stage", "этап"), tx, ty);
    tft.setTextColor(white, panel);
    tft.drawString(ota.failPhase() == OtaManager::DOWNLOADING ? i18n::tr("download", "загрузка")
                                                              : i18n::tr("check", "проверка"), tx + 66, ty);
    ty += 22;
    if (ota.httpCode() != 0) {
        tft.setTextColor(label, panel); tft.drawString(i18n::tr("code", "код"), tx, ty);
        snprintf(buf, sizeof(buf), "%d", ota.httpCode());
        tft.setTextColor(white, panel); tft.drawString(buf, tx + 66, ty);
        ty += 22;
    }
    if (ota.detail()[0]) {
        tft.setTextColor(label, panel); tft.drawString(i18n::tr("detail", "детали"), tx, ty); ty += 18;
        fontTiny(); tft.setTextColor(dim, panel);
        ty = drawWrapped(ota.detail(), tx, ty, 208, 15, 3) + 4;
        fontSmall();
    }
    snprintf(buf, sizeof(buf), "%s%s", i18n::tr("installed v", "стоит v"), OtaManager::current());
    tft.setTextColor(label, panel); tft.drawString(buf, tx, ty);

    fontTiny(); tft.setTextColor(dim, bg);
    tft.setTextDatum(ML_DATUM); tft.drawString(i18n::tr("◀ back", "◀ назад"), 8, 309);
    tft.setTextDatum(MR_DATUM); tft.drawString(i18n::tr("retry ▶", "повтор ▶"), 232, 309);
    fontOff();
}

// The progress "slider" with the current step written on it (redrawn alone on % change).
static void otaBar() {
    const int x = 16, y = 268, w = 208, h = 26;
    const uint16_t barbg = tft.color565(0x14, 0x1a, 0x14);
    const uint16_t panel = tft.color565(0x0b, 0x11, 0x0b);
    static TFT_eSprite bar(&tft);
    static bool made = false;
    if (!made) { bar.createSprite(w, h); bar.loadFont(font_ru_small); made = true; }
    const char* label; int pct; uint16_t fill;
    switch (ota.phase()) {
        case OtaManager::CHECKING:    label = i18n::tr("Checking...", "Проверяю...");        pct = 12;  fill = tft.color565(0x7a, 0x6a, 0x2a); break;
        case OtaManager::UPTODATE:    label = i18n::tr("Latest version", "Последняя версия"); pct = 100; fill = tft.color565(0x2e, 0x6a, 0x3e); break;
        case OtaManager::AVAILABLE:   label = i18n::tr("OK: update", "OK: обновить");         pct = 0;   fill = tft.color565(0xff, 0xcf, 0x3f); break;
        case OtaManager::DOWNLOADING: { static char b[28]; snprintf(b, sizeof(b), "%s %d%%", i18n::tr("Downloading", "Загрузка"), ota.progress()); label = b; pct = ota.progress(); fill = tft.color565(0x2e, 0x8a, 0x3e); break; }
        case OtaManager::DONE:        label = i18n::tr("Done! reboot...", "Готово! рестарт..."); pct = 100; fill = tft.color565(0x2e, 0x8a, 0x3e); break;
        case OtaManager::FAILED:      label = otaErrText(ota.err());                          pct = 100; fill = tft.color565(0x8a, 0x2a, 0x2a); break;
        default:                      label = "";                                            pct = 0;   fill = barbg; break;
    }
    bar.fillSprite(panel);                    // compose off-screen, push once — no flicker
    bar.fillRoundRect(0, 0, w, h, 7, barbg);
    int fw = (w - 4) * pct / 100;
    if (fw > 0) bar.fillRoundRect(2, 2, fw < 6 ? 6 : fw, h - 4, 5, fill);
    bar.setTextDatum(MC_DATUM);
    bar.setTextColor(tft.color565(0xff, 0xff, 0xf2), barbg);
    bar.drawString(label, w / 2, h / 2);
    bar.pushSprite(x, y);
}

static void drawOtaScreen() {
    if (ota.phase() == OtaManager::FAILED) { drawOtaError(); return; }
    const uint16_t gold  = tft.color565(0xff, 0xcf, 0x3f);
    const uint16_t dim   = tft.color565(0xbe, 0xc8, 0xb6);
    const uint16_t amber = tft.color565(0xff, 0xa5, 0x2a);
    const uint16_t panel = tft.color565(0x0b, 0x11, 0x0b);
    tft.setSwapBytes(true);
    tft.pushImage(0, 0, IMG_RIDER_W, IMG_RIDER_H, img_rider);   // rider = the whole background
    tft.setSwapBytes(false);
    tft.fillRoundRect(6, 196, 228, 118, 10, panel);             // dark panel for legible text
    fontBig(); tft.setTextDatum(TL_DATUM); tft.setTextColor(gold, panel);
    tft.drawString(i18n::tr("Update", "Обновление"), 16, 204);
    fontSmall(); tft.setTextColor(dim, panel);
    String line = (ota.phase() == OtaManager::AVAILABLE)
                    ? String(i18n::tr("Available: ", "Доступно: ")) + ota.latest()
                    : String(i18n::tr("Installed: v", "Установлено: v")) + OtaManager::current();
    tft.drawString(line, 16, 236);
    otaBar();
    if (ota.phase() == OtaManager::DOWNLOADING) {
        fontTiny(); tft.setTextDatum(MC_DATUM); tft.setTextColor(amber, panel);
        tft.drawString(i18n::tr("Do not power off", "Не выключай питание"), 120, 302);
    } else {
        fontTiny(); tft.setTextDatum(ML_DATUM); tft.setTextColor(dim, panel);
        tft.drawString(i18n::tr("◀ back", "◀ назад"), 16, 302);
        if (ota.phase() == OtaManager::AVAILABLE) {
            tft.setTextDatum(MR_DATUM);
            tft.drawString(i18n::tr("update ▶", "обновить ▶"), 224, 302);
        }
    }
    fontOff();
}

static void gotoOta() {
    // Reclaim BLE RAM up-front, before the version check — not just before the download.
    // A BLE session leaves the stack resident; freeing it hands the allocator ~70 KB more
    // room so the check's TLS can't fragment the heap below the two ~16 KB contiguous record
    // buffers the download then needs (measured: post-check largest block 31 KB without this,
    // 65 KB with it). The update flow ends in a reboot, so tearing BLE down here is safe;
    // no-op if BLE never ran. Pause the scan first so we don't free BLE mid-scan.
    engine.pauseAndWait();
    if (engine.releaseBleForOta())
        Serial.printf("[OTA] BLE freed before check: free=%u largest=%u\n",
                      (unsigned)ESP.getFreeHeap(), (unsigned)ESP.getMaxAllocHeap());
    ota.startCheck(); seenOtaGen = ota.gen(); seenOtaPhase = -1; st = ST_OTA; drawOtaScreen();
}

