anton-vinogradov/esp32-leshy/src/main.cpp
static void otaActivate() {
    if (ota.phase() == OtaManager::AVAILABLE) ota.startUpdate();
    else if (ota.phase() == OtaManager::UPTODATE || ota.phase() == OtaManager::FAILED) ota.startCheck();
}

static void drawAboutScreen() {
    const uint16_t bg = uiBg();
    const uint16_t gold  = tft.color565(0xff, 0xcf, 0x3f);
    const uint16_t white = tft.color565(0xe8, 0xe8, 0xe0);
    const uint16_t dim   = tft.color565(0x8f, 0xa9, 0x8f);
    uiHeaderRu(i18n::tr("About", "О девайсе"));
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    tft.setTextDatum(TL_DATUM);
    fontSmall();
    int y = 46;
    tft.setTextColor(dim, bg);   tft.drawString(i18n::tr("Hardware", "Железо"), 14, y); y += 22;
    tft.setTextColor(white, bg); tft.drawString("ESP32-DIV (ESP32-S3)", 22, y); y += 20;
    tft.setTextColor(dim, bg);   tft.drawString(i18n::tr("by CiferTech", "от CiferTech"), 22, y); y += 32;
    tft.setTextColor(dim, bg);   tft.drawString(i18n::tr("Firmware", "Прошивка"), 14, y); y += 22;
    tft.setTextColor(gold, bg);  tft.drawString("ESP32-Leshy", 22, y); y += 20;
    tft.setTextColor(white, bg); tft.drawString(String(i18n::tr("version v", "версия v")) + LESHY_FW_VERSION, 22, y); y += 20;
    tft.setTextColor(dim, bg);   tft.drawString(String(i18n::tr("released ", "выпуск ")) + LESHY_FW_DATE, 22, y); y += 30;
    tft.setTextColor(dim, bg);   tft.drawString(i18n::tr("Author", "Автор"), 14, y); y += 22;
    tft.setTextColor(white, bg); tft.drawString(i18n::tr("Anton Vinogradov", "Антон Виноградов"), 22, y); y += 30;
    tft.setTextColor(dim, bg);   tft.drawString("GitHub", 14, y); y += 20;
    fontTiny(); tft.setTextColor(white, bg);
    tft.drawString("anton-vinogradov/esp32-leshy", 22, y);
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back");
    fontOff();
    drawNetBadge();
}

// ---- Deauth monitor screen (passive/defensive) ----
// Repaints only what changed (rule: no full-screen redraw on refresh — it flickers).
static const int DA_BADGE_Y = 44, DA_ROW1 = 104, DA_ROW2 = 132, DA_ROW3 = 160, DA_SRC_Y = 214;
static int    daLastAlert = -1, daLastRecent = -1, daLastChan = -1;
static long   daLastTotal = -1;
static String daLastMac;

static void deauthValue(int y, const String& val, uint16_t col) {
    const uint16_t bg = uiBg();
    tft.fillRect(120, y - 2, 108, 22, bg);          // value column only
    fontSmall();
    tft.setTextDatum(TR_DATUM);
    tft.setTextColor(col, bg);
    tft.drawString(val, 226, y);
}

static void deauthBadge(bool alert) {
    const uint16_t bc = alert ? tft.color565(0xd1, 0x4c, 0x4c) : tft.color565(0x2f, 0x6a, 0x3e);
    tft.fillRoundRect(12, DA_BADGE_Y, 216, 42, 9, bc);
    fontBig(); tft.setTextDatum(MC_DATUM); tft.setTextColor(tft.color565(0xff, 0xff, 0xf2), bc);
    tft.drawString(alert ? i18n::tr("ALERT", "ТРЕВОГА") : i18n::tr("Clear", "Чисто"), 120, DA_BADGE_Y + 22);
}

static void deauthRefresh() {                        // called on a timer; touches only changed fields
    const uint16_t bg = uiBg();
    const uint16_t white = tft.color565(0xe8, 0xe8, 0xe0);
    const uint16_t gold  = tft.color565(0xff, 0xcf, 0x3f);
    const uint16_t red   = tft.color565(0xd1, 0x4c, 0x4c);
    bool alert  = detector.alerting();
    int  recent = detector.recentCount();
    long total  = (long)detector.total();
    int  chan   = detector.channel();
    if (alert != (bool)daLastAlert) { daLastAlert = alert; deauthBadge(alert); }
    if (recent != daLastRecent) { daLastRecent = recent; deauthValue(DA_ROW1, String(recent), alert ? red : white); }
    if (total  != daLastTotal)  { daLastTotal  = total;  deauthValue(DA_ROW2, String(total), white); }
    if (chan   != daLastChan)   { daLastChan   = chan;   deauthValue(DA_ROW3, String(chan), white); }
    DeauthEvent e;
    if (detector.lastEvent(e)) {
        char mac[18];
        snprintf(mac, sizeof(mac), "%02X:%02X:%02X:%02X:%02X:%02X", e.src[0], e.src[1], e.src[2], e.src[3], e.src[4], e.src[5]);
        if (daLastMac != mac) {
            daLastMac = mac;
            tft.fillRect(14, DA_SRC_Y - 2, 212, 20, bg);
            fontOff(); tft.setTextDatum(TL_DATUM); tft.setTextColor(gold, bg);
            tft.drawString(mac, 20, DA_SRC_Y, 2);
        }
    }
    fontOff();
}

static void drawDeauthScreen() {                     // full paint: static chrome + labels, then values
    const uint16_t bg = uiBg();
    const uint16_t dim = tft.color565(0x8f, 0xa9, 0x8f);
    uiHeaderRu(i18n::tr("Deauth monitor", "Детектор атак"));
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    daLastAlert = -1; daLastRecent = -1; daLastTotal = -1; daLastChan = -1; daLastMac = "";
    fontSmall();
    tft.setTextDatum(TL_DATUM); tft.setTextColor(dim, bg);
    tft.drawString(i18n::tr("In window", "За окно"), 14, DA_ROW1);
    tft.drawString(i18n::tr("Total", "Всего"),      14, DA_ROW2);
    tft.drawString(i18n::tr("Channel", "Канал"),    14, DA_ROW3);
    tft.drawString(i18n::tr("Last source", "Источник"), 14, DA_SRC_Y - 26);
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back");
    fontOff();
    drawNetBadge();
    deauthRefresh();
}

// ---- Channel analyzer: per-channel scrolling area graphs (cardiograph style) ----
static const int CH_HIST = 212;                 // samples kept per channel (graph width)
static const int CH_ROWH = 20, CH_TOP = 34, CH_GX = 24, CH_GW = CH_HIST, CH_GH = 17;
static uint8_t chHist[14][CH_HIST];             // load history per channel (0..CH_GH)
static int     chHead = 0;                      // ring write position
static bool    chReady = false;

// Full graph height = this much real airtime. Decoded airtime is a lower bound (we
// miss frames and estimate the rate), and ambient air (beacons only) sits around
// 1%, so full-scale is set low: quiet channels show a small baseline, and genuine
// traffic (a nearby download/stream) clearly rises above it. Honest relative
// busyness, not a calibrated percentage — the footer says "est.".
static const int CH_FULLSCALE_PM = 80;          // permille (~8%) that fills a row

static void channelSample() {                   // push one column of real per-channel airtime
    uint16_t pm[14];
    airtime.read(pm);
    for (int ch = 1; ch <= 13; ch++) {
        int v = pm[ch] * CH_GH / CH_FULLSCALE_PM;
        chHist[ch][chHead] = (uint8_t)(v > CH_GH ? CH_GH : v);
    }
    chHead = (chHead + 1) % CH_HIST;
    chReady = true;
}

// Each graph row is composed off-screen and pushed in one go — fast and flicker-free.
static void channelGraphs() {
    const uint16_t grid = tft.color565(0x1b, 0x24, 0x1b);
    static TFT_eSprite g(&tft);
    static bool made = false;
    if (!made) { g.createSprite(CH_GW, CH_GH); made = true; }
    for (int ch = 1; ch <= 13; ch++) {
        int gy = CH_TOP + (ch - 1) * CH_ROWH;
        bool clean = (ch == 1 || ch == 6 || ch == 11);   // non-overlapping channels
        uint16_t line = clean ? tft.color565(0x5c, 0xe1, 0x74) : tft.color565(0x4a, 0x9a, 0xaa);
        uint16_t fill = clean ? tft.color565(0x1e, 0x4a, 0x28) : tft.color565(0x1b, 0x3a, 0x42);
        g.fillSprite(grid);
        for (int x = 0; x < CH_HIST; x++) {
            int v = chHist[ch][(chHead + x) % CH_HIST];   // oldest -> newest, left to right
            if (v > 0) {
                g.drawFastVLine(x, CH_GH - v, v, fill);   // filled volume
                g.drawPixel(x, CH_GH - v, line);          // the trace on top
            } else {
                g.drawPixel(x, CH_GH - 1, line);
            }
        }
        g.pushSprite(CH_GX, gy);
    }
}

