anton-vinogradov/esp32-leshy/src/main.cpp
static void channelLabels() {                    // static column of channel numbers
    const uint16_t bg   = uiBg();
    const uint16_t gold = tft.color565(0xff, 0xcf, 0x3f);
    const uint16_t dim  = tft.color565(0x8f, 0xa9, 0x8f);
    fontOff();
    for (int ch = 1; ch <= 13; ch++) {
        int gy = CH_TOP + (ch - 1) * CH_ROWH;
        bool clean = (ch == 1 || ch == 6 || ch == 11);
        tft.fillRect(0, gy, CH_GX, CH_ROWH, bg);
        tft.setTextDatum(MR_DATUM);
        tft.setTextColor(clean ? gold : dim, bg);
        tft.drawString(String(ch), 21, gy + CH_GH / 2, 1);
    }
}

static void drawChannelScreen() {
    const uint16_t bg = uiBg();
    uiHeaderRu(i18n::tr("Channels 2.4G", "Каналы 2.4ГГц"), i18n::tr("airtime", "эфир"));
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    channelLabels();
    channelGraphs();
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back", i18n::tr("busy, est.", "занятость ~"));
    drawNetBadge();
}

// ---- 2.4GHz spectrum waterfall (NRF24) ----
// Flicker-free by construction: instead of scrolling a full-screen sprite (a ~31ms
// blit per frame → visible tearing), we write ONE new row directly to the panel at
// a moving cursor and never move the existing pixels — a ring-buffer waterfall with
// a bright sweep line marking "now". Each update is a 228x1 push (~0.1ms). No big
// sprite either, so ~106 KB of heap stays free.
static const int SP_X = 6, SP_Y = 46, SP_W = 228, SP_H = 220;   // plot area (legend row above, 2 label rows below)
static int      spEma[Nrf24Spectrum::CHANNELS];                 // per-channel busy level 0..255 (smoothed) — gives a full colour gradient
static uint32_t spRowAt = 0;
static int      spWy = 0;                                       // current write row within the plot (ring)
static uint8_t  spGrid[SP_W];                                   // per-column WiFi-channel marker: 0 none, 1 minor, 2 major (1/6/11)
// TX self-test state: which Wi-Fi channels are armed for noise injection, where the
// selection caret sits, and whether we are actually emitting. Persist while on screen.
static uint16_t spTxMask = 0;                                   // armed Wi-Fi channels (bit 1..13)
static int      spCursor = 6;                                  // Wi-Fi channel under the caret (1..13)
static bool     spTxOn   = false;                              // master TX on/off
static bool     spLab    = false;                              // true = Lab noise generator (TX controls); false = passive Spectrum
// Beacon TX modes: short RIGHT = static (fixed channels) / follow-caret live; long RIGHT = auto-sweep.
static bool     spSweep   = false;                             // auto-sweep: one carrier marches across the channels
static int      spSweepCh = 1;                                 // current sweep Wi-Fi channel (1..13)
static uint32_t spSweepAt = 0;                                 // sweep step timer
static const int SP_SWEEP_MS = 350;                            // dwell per channel while sweeping
static bool     spRightPending = false, spRightLong = false;   // RIGHT long-press tracking (Lab screen)
static uint32_t spRightAt = 0;
static int      spRightRel = 0;                                // consecutive "released" reads (debounce I2C 0xFF glitches)
// Traffic view: subtract a slow per-channel baseline so the constant floor (beacons, steady
// BT) fades and only activity ABOVE it stands out. RPD is 1-bit, so this shows changes in
// occupancy (bursts), not decoded traffic — a steady stream shows only when it starts.
// Traffic = a MEDIUM-smoothed occupancy minus the SLOW floor, noise-gated. The medium
// EMA averages out single beacon/BT hits (1-bit RPD is jumpy: one hit = +31), so only a
// sustained rise above the floor survives — the real bursts, not the beacon flicker.
static int      spCurF[Nrf24Spectrum::CHANNELS];               // medium EMA, fixed-point (value * 1024)
static int      spBaseF[Nrf24Spectrum::CHANNELS];              // slow floor,  fixed-point (value * 1024)
static bool     spTraffic = false;                             // false = occupancy heat; true = above-baseline traffic
static int      spBasePrime = 0;                               // >0: glue cur/base to spEma while the EMA settles (no cold-start flood)
static const int SP_CUR_TAU  = 32;                             // medium smoothing (~1 s) — kills single-hit flicker
static const int SP_BASE_TAU = 256;                            // slow floor (~9 s) — steady sources sink into it
static const int SP_TRAFFIC_GAIN = 3, SP_TRAFFIC_FLOOR = 12;   // burst amplification and the noise gate (ignore small jitter)
static const int SP_PRIME_N  = 40;                             // sweeps (~1.5 s) to seed the floor on screen entry
static const uint16_t SP_BG = 0x0862;                          // near-black plot background (RGB565)
// Only the used part of the band is shown, stretched to full width: NRF ch 2..84 =
// 2402..2484 MHz covers all Wi-Fi (1..14) and Bluetooth. The dead ISM edges
// (2400..2402, 2484..2525) are dropped so channels 1..13 spread across the screen.
static const int SP_CH_LO = 2, SP_CH_HI = 84;
static inline int spNrfToX(int nc) { return (nc - SP_CH_LO) * SP_W / (SP_CH_HI - SP_CH_LO); }
static inline int spXToNrf(int x)  { return SP_CH_LO + x * (SP_CH_HI - SP_CH_LO) / SP_W; }

// Energy → heat colour: blue → cyan → green → yellow → red.
static uint16_t spColor(int e, int maxN) {
    if (e <= 0 || maxN <= 0) return SP_BG;
    float f = (float)e / maxN; if (f > 1) f = 1;
    uint8_t r, g, b;
    if      (f < 0.25f) { r = 0;                                g = (uint8_t)(f / 0.25f * 160);         b = 210; }
    else if (f < 0.50f) { r = 0;                                g = 160 + (uint8_t)((f - 0.25f) / 0.25f * 95); b = (uint8_t)(210 - (f - 0.25f) / 0.25f * 210); }
    else if (f < 0.75f) { r = (uint8_t)((f - 0.50f) / 0.25f * 255); g = 255;                            b = 0; }
    else                { r = 255;                              g = (uint8_t)(255 - (f - 0.75f) / 0.25f * 255); b = 0; }
    return tft.color565(r, g, b);
}
static const uint16_t SP_GMAJ = 0x6AA2, SP_GMIN = 0x2164;       // channel dividers: dim gold (1/6/11), faint grey-green (others)

