anton-vinogradov/esp32-leshy/src/main.cpp
// Push one waterfall row at the ring cursor and advance it, leaving a bright sweep
// line just ahead of the newest data. Shared by the 2.4GHz (NRF) and Sub-GHz (CC1101)
// spectrum screens — one 228x1 blit, no pixels moved, so it never flickers.
static void wfPushRow(const uint16_t* row) {
    tft.setSwapBytes(false);
    tft.pushImage(SP_X, SP_Y + spWy, SP_W, 1, (uint16_t*)row);
    spWy = (spWy + 1) % SP_H;
    tft.drawFastHLine(SP_X, SP_Y + spWy, SP_W, tft.color565(0x6a, 0x80, 0x6a));
}

// The quiet→busy colour legend, shared by both spectrum screens. Cyrillic labels
// need the smooth VLW font (font1 is ASCII-only).
static void wfLegend(uint16_t bg, uint16_t dim, const char* lo = nullptr, const char* hi = nullptr) {
    const int by = 32, bh = 8, bw = 118, bx = SP_X + 46;
    for (int i = 0; i < bw; i++) tft.drawFastVLine(bx + i, by, bh, spColor(i * 255 / (bw - 1), 255));
    tft.drawRect(bx - 1, by - 1, bw + 2, bh + 2, tft.color565(0x2a, 0x3a, 0x2a));
    fontTiny();
    tft.setTextColor(dim, bg);
    tft.setTextDatum(MR_DATUM); tft.drawString(lo ? lo : i18n::tr("quiet", "тихо"), bx - 5, by + bh / 2);
    tft.setTextDatum(ML_DATUM); tft.drawString(hi ? hi : i18n::tr("busy", "занято"), bx + bw + 5, by + bh / 2);
    fontOff();
}

static void spectrumStop() { spTxOn = false; spSweep = false; spRightPending = false; spRightRel = 0; nrf.end(); }

// Effective TX target: nothing when off; the sweep channel while sweeping; the fixed set
// if any is armed; else the caret channel live (follow-cursor "real-time" mode).
static uint16_t spEffMask() {
    if (!spTxOn) return 0;
    if (spSweep)  return (uint16_t)(1 << spSweepCh);
    if (spTxMask) return spTxMask;
    return (uint16_t)(1 << spCursor);
}
static void spApplyTx() { nrf.setTxWifiMask(spEffMask()); }

// The channel axis below the plot: a tick + number per Wi-Fi channel (armed ones in
// orange-red), plus the selection caret. Redrawn on any change; touches only the strip
// under the plot, never the live waterfall above it.
static void spDrawAxis() {
    const uint16_t bg = uiBg(), dim = tft.color565(0x8f, 0xa9, 0x8f), gold = tft.color565(0xff, 0xcf, 0x3f);
    const uint16_t armed = tft.color565(0xff, 0x5a, 0x32);
    const uint16_t caret = spTxOn ? armed : tft.color565(0x46, 0xd6, 0xff);   // cyan idle → red while emitting
    tft.fillRect(0, SP_Y + SP_H + 1, 240, 34, bg);                           // clear the strip (footer starts at y=301)
    fontOff();                                                               // channel numbers use the built-in font (arg 1); a loaded VLW would override it
    tft.setTextDatum(MC_DATUM);
    for (int w = 1; w <= 13; w++) {
        int sx = spNrfToX(Nrf24Spectrum::wifiCenterNrfCh(w));
        if (sx < 0 || sx >= SP_W) continue;
        int x = SP_X + sx;
        bool major = (w == 1 || w == 6 || w == 11);
        uint16_t col = (spLab && (spTxMask & (1 << w))) ? armed : (major ? gold : dim);
        if (spLab && w == spCursor) tft.fillTriangle(x - 3, SP_Y + SP_H + 1, x + 3, SP_Y + SP_H + 1, x, SP_Y + SP_H + 7, caret);
        tft.drawFastVLine(x, SP_Y + SP_H + 8, 3, col);
        tft.setTextColor(col, bg);
        tft.drawString(String(w), x, SP_Y + SP_H + (w & 1 ? 16 : 26), 1);     // odd row higher, even lower
    }
}

static void spDrawFooter() {
    // Passive Spectrum just shows a legend; the Lab generator shows the TX controls.
    // Only glyphs present in the tiny VLW subset (letters, space, ◀ ▶ ▼): ▲▼ move the
    // caret, the middle key (OK) arms the channel, ▶ starts/stops the noise.
    if (!spLab) { uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back",
                             spTraffic ? i18n::tr("traffic ▶", "трафик ▶") : i18n::tr("occupancy ▶", "занятость ▶")); return; }
    const char* right = spSweep ? (i18n::isRu() ? "СВИП  ▶ стоп"      : "SWEEP  ▶ stop")
                      : spTxOn   ? (i18n::isRu() ? "стоп ▶  держ=свип" : "stop ▶  hold=sweep")
                                 : (i18n::isRu() ? "OK канал  ▶ старт" : "OK chan  ▶ start");
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back", right);
}

// SELECT fixes/unfixes the caret channel (a static beacon target). Leaves sweep mode.
static void spToggleArm() {
    spSweep = false;
    spTxMask ^= (uint16_t)(1 << spCursor);
    spApplyTx();
    spDrawAxis();
    spDrawFooter();
}

// Short RIGHT: start/stop the static/follow beacon. With channels fixed it hits those; with
// none fixed the carrier follows the caret live (move ▲▼ and it tracks you — real-time).
static void spToggleTx() {
    spSweep = false;
    spTxOn = !spTxOn;
    spApplyTx();
    spDrawAxis();
    spDrawFooter();
}

// Long RIGHT: start/stop the auto-sweep — one carrier marching across every channel.
static void spSweepToggle() {
    spSweep = !spSweep;
    spTxOn = spSweep;
    if (spSweep) { spSweepCh = 1; spCursor = 1; spSweepAt = millis(); }
    spApplyTx();
    spDrawAxis();
    spDrawFooter();
}

static void drawSpectrumScreen() {
    const uint16_t bg = uiBg(), dim = tft.color565(0x8f, 0xa9, 0x8f);
    char hr[20];
    if (spLab) {
        snprintf(hr, sizeof(hr), "x%d %s", nrf.modules(),
                 nrf.txListenSelf() ? i18n::tr("chk", "проба") : i18n::tr("max", "макс"));
        uiHeaderRu(i18n::tr("Generator", "Генератор"), hr);
    } else {
        snprintf(hr, sizeof(hr), "NRF24 x%d", nrf.modules());
        uiHeaderRu(i18n::tr("2.4GHz Spectrum", "Спектр 2.4ГГц"), hr);
    }
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    wfLegend(bg, dim, (spTraffic && !spLab) ? i18n::tr("base", "фон") : nullptr,
                      (spTraffic && !spLab) ? i18n::tr("spike", "всплеск") : nullptr);
    tft.fillRect(SP_X, SP_Y, SP_W, SP_H, SP_BG);
    tft.drawRect(SP_X - 1, SP_Y - 1, SP_W + 2, SP_H + 2, tft.color565(0x2a, 0x3a, 0x2a));
    // Vertical divider column for every Wi-Fi channel 1..13 (1/6/11 stand out); pre-drawn
    // full height and overwritten by real energy as the waterfall fills. The tick+number
    // strip and the selection caret below the plot are drawn by spDrawAxis().
    memset(spGrid, 0, sizeof(spGrid));
    for (int w = 1; w <= 13; w++) {
        int sx = spNrfToX(Nrf24Spectrum::wifiCenterNrfCh(w));
        if (sx < 0 || sx >= SP_W) continue;
        spGrid[sx] = (w == 1 || w == 6 || w == 11) ? 2 : 1;
        tft.drawFastVLine(SP_X + sx, SP_Y, SP_H, spGrid[sx] == 2 ? SP_GMAJ : SP_GMIN);
    }
    spDrawAxis();
    spDrawFooter();
    drawNetBadge();
    memset(spEma, 0, sizeof(spEma)); spBasePrime = SP_PRIME_N; spRowAt = millis(); spWy = 0;   // baseline seeds from spEma over the first ~1 s (no cold-start flood)
}

