anton-vinogradov/esp32-leshy/src/main.cpp
// Spectrum view: occupancy heat vs traffic (above-baseline). Persisted; shared by the
// passive Spectrum and the Lab generator (the passive screen's ▶ flips it live).
static void saveSpView(bool traffic) { Preferences p; p.begin("leshy", false); p.putBool("sp_view", traffic); p.end(); }
static bool loadSpView() { Preferences p; p.begin("leshy", true); bool v = p.getBool("sp_view", false); p.end(); return v; }
// Repaint only the mode chrome (legend + footer) above/below the plot — keeps the
// waterfall and the learned baseline, so occupancy <-> traffic flips instantly.
static void spRepaintChrome() {
    const uint16_t bg = uiBg(), dim = tft.color565(0x8f, 0xa9, 0x8f);
    tft.fillRect(0, 28, 240, SP_Y - 29, bg);     // legend band above the plot (does not touch the waterfall)
    wfLegend(bg, dim, (spTraffic && !spLab) ? i18n::tr("base", "фон") : nullptr,
                      (spTraffic && !spLab) ? i18n::tr("spike", "всплеск") : nullptr);
    spDrawFooter();
}
static void spToggleView() {
    spTraffic = !spTraffic;
    saveSpView(spTraffic);
    spRepaintChrome();
}

static void spectrumTick() {
    if (spSweep && spTxOn && millis() - spSweepAt >= SP_SWEEP_MS) {   // auto-sweep: march the carrier one channel on
        spSweepAt = millis();
        spSweepCh = spSweepCh >= 13 ? 1 : spSweepCh + 1;
        spCursor = spSweepCh;
        spApplyTx();
        spDrawAxis();
    }
    uint8_t sw[Nrf24Spectrum::CHANNELS];
    nrf.sweep(sw);                                       // ~25ms across 126 channels; RPD is 1-bit per channel
    for (int c = 0; c < Nrf24Spectrum::CHANNELS; c++) {
        spEma[c] += ((int)sw[c] * 255 - spEma[c]) / 8;  // fast occupancy (0..255) → occupancy view
        int e1024 = (int)spEma[c] << 10;
        if (spBasePrime) { spCurF[c] = e1024; spBaseF[c] = e1024; }        // seed both to the settling EMA — no cold-start flood
        else {
            spCurF[c]  += (e1024 - spCurF[c])  / SP_CUR_TAU;               // medium: averages out single beacon/BT hits
            spBaseF[c] += (e1024 - spBaseF[c]) / SP_BASE_TAU;              // slow floor: steady sources sink in
        }
    }
    if (spBasePrime) spBasePrime--;
    if (millis() - spRowAt < 37) return;                // one waterfall row every ~37ms (fast scroll)
    spRowAt = millis();
    static uint16_t row[SP_W];
    for (int x = 0; x < SP_W; x++) {
        int c = spXToNrf(x);
        if (c < 0) c = 0; else if (c >= Nrf24Spectrum::CHANNELS) c = Nrf24Spectrum::CHANNELS - 1;
        int v = spEma[c];
        if (spTraffic && !spLab) {                      // traffic (passive only): medium level above the slow floor, noise-gated
            int d = ((spCurF[c] - spBaseF[c]) >> 10) - SP_TRAFFIC_FLOOR;
            v = d > 0 ? d * SP_TRAFFIC_GAIN : 0;
            if (v > 255) v = 255;
        }
        if      (v > 8)            row[x] = spColor(v, 255);             // energy / burst → heat gradient
        else if (spGrid[x] == 2)   row[x] = SP_GMAJ;                      // channel divider shows through quiet air
        else if (spGrid[x] == 1)   row[x] = SP_GMIN;
        else                       row[x] = SP_BG;
    }
    wfPushRow(row);                                     // one row, direct — no pixels moved, no flicker
}

// ---- Sub-GHz spectrum waterfall (CC1101) ----
// Same flicker-free ring waterfall, but the CC1101 gives a real RSSI per frequency,
// so the heat is true signal strength. RIGHT cycles the display window: whole span,
// then aimed technical bands (315/433 remotes & alarms, 868/915 mesh & LoRa).
static const int SUB_NB = 40;                           // frequencies swept per row (fewer = ~3x faster scroll; mapped across the width)
static uint8_t   subE[SUB_NB];
static int       subBin = 0;                            // sweep progress (spread across loop iterations for button responsiveness)

static void subStop() { cc.end(); }

static void drawSubScreen() {
    const uint16_t bg = uiBg(), dim = tft.color565(0x8f, 0xa9, 0x8f), gold = tft.color565(0xff, 0xcf, 0x3f);
    const Cc1101Spectrum::Band& b = cc.bandInfo();
    uiHeaderRu(i18n::tr("Sub-GHz Spectrum", "Спектр Sub-GHz"), "CC1101");
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    wfLegend(bg, dim);
    tft.fillRect(SP_X, SP_Y, SP_W, SP_H, SP_BG);
    tft.drawRect(SP_X - 1, SP_Y - 1, SP_W + 2, SP_H + 2, tft.color565(0x2a, 0x3a, 0x2a));
    // axis: localized band name (centre) on the VLW font + the MHz range at the ends
    fontTiny();
    tft.setTextColor(gold, bg); tft.setTextDatum(MC_DATUM);
    tft.drawString(i18n::isRu() ? b.ru : b.en, SP_X + SP_W / 2, SP_Y + SP_H + 13);
    tft.setTextColor(dim, bg);
    tft.setTextDatum(ML_DATUM); tft.drawString(String(b.loKHz / 1000), SP_X, SP_Y + SP_H + 13);
    tft.setTextDatum(MR_DATUM); tft.drawString(String(b.hiKHz / 1000) + (i18n::isRu() ? " МГц" : " MHz"), SP_X + SP_W, SP_Y + SP_H + 13);
    fontOff();
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back", i18n::tr("band ▶", "диапазон ▶"));
    drawNetBadge();
    spWy = 0; subBin = 0;
}

static void subTick() {
    // Sweep only a few bins per loop iteration so buttons (band switch) stay snappy —
    // a full CC1101 sweep is ~150-250ms, too long to block the input poll.
    for (int k = 0; k < 10 && subBin < SUB_NB; k++, subBin++) subE[subBin] = cc.sampleBin(subBin, SUB_NB);
    if (subBin < SUB_NB) return;                        // sweep still in progress
    subBin = 0;
    static uint16_t row[SP_W];
    for (int x = 0; x < SP_W; x++) {
        int bin = x * SUB_NB / SP_W; if (bin >= SUB_NB) bin = SUB_NB - 1;
        int e = subE[bin];
        row[x] = (e > 12) ? spColor(e, 255) : SP_BG;    // above the noise floor → heat
    }
    wfPushRow(row);
}

// ---- Sub-GHz test transmitter (CC1101) ----
// One CC1101 → pure TX, so it can't watch its own signal — verify on an external RX.
// RIGHT cycles the band, the middle key toggles TX; the sub-GHz antenna LED goes yellow.
static const uint8_t CC_PA[]     = { 0xC0, 0x84, 0x60, 0x34, 0x1D };   // PATABLE presets, max→min
static const int8_t  CC_PA_DBM[] = {   10,    5,    0,   -6,  -15 };   // approx dBm (433 MHz)
static const int     CC_PA_N     = sizeof(CC_PA) / sizeof(CC_PA[0]);
static int  subPwrIdx = 0;                          // 0 = max
static bool subTxOn   = false;

static void saveSubPower(int idx) { Preferences p; p.begin("leshy", false); p.putUChar("cc_pwr_i", (uint8_t)idx); p.end(); }
static int  loadSubPower() { Preferences p; p.begin("leshy", true); int v = p.getUChar("cc_pwr_i", 0); p.end(); return (v >= 0 && v < CC_PA_N) ? v : 0; }

// Sub-GHz settings (set via the SubCfg phone portal, saved to NVS, applied by loadSubCfg).
static uint32_t recWaitMs  = 30000;                 // recorder signal-wait timeout
static uint32_t subFreqKHz = 0;                     // exact TX/capture freq override (0 = band centre)
static int      recRepeats = 3;                     // replay repeat count
static int      subCfgPhase = 0;                    // settings-portal screen phase: 0 waiting · 1 saved · 2 stopped

static bool cc1101FreqOk(uint32_t f) {              // the chip only tunes these sub-bands
    return (f >= 300000 && f <= 348000) || (f >= 387000 && f <= 464000) || (f >= 779000 && f <= 928000);
}

// TX/capture frequency: the exact override if set & tunable, else the band centre, else
// 433.92 (the "full 300-928" centre is 614 MHz, inside a CC1101 gap).
static uint32_t subTxFreqKHz() {
    if (subFreqKHz && cc1101FreqOk(subFreqKHz)) return subFreqKHz;
    uint32_t f = Cc1101Spectrum::bandCenterKHz(cc.bandInfo());
    return cc1101FreqOk(f) ? f : 433920;
}

