anton-vinogradov/esp32-leshy/src/main.cpp
static void loadSubCfg() {                          // read all Sub-GHz settings from NVS and apply
    Preferences p; p.begin("leshy", true);
    recWaitMs  = p.getUInt("rec_wait", 30000);
    subFreqKHz = p.getUInt("sub_freq", 0);
    recRepeats = p.getUChar("rep_n", 3);
    int  thr   = p.getInt("cap_thr", -72);
    bool fsk   = p.getUChar("sub_mod", 0) != 0;
    bool inv   = p.getBool("sub_inv", false);
    p.end();
    if (recWaitMs < 3000 || recWaitMs > 300000) recWaitMs = 30000;   // guard corrupt/legacy NVS
    if (recRepeats < 1 || recRepeats > 20) recRepeats = 3;
    if (thr < -110 || thr > -30) thr = -72;
    cc.setCaptureThreshold(thr);
    cc.setModulation(fsk);
    cc.setInvert(inv);
}

static void subTxApply() {                          // (re)tune TX to a valid frequency at the set power
    cc.setTxPower(CC_PA[subPwrIdx]);
    cc.beginTx(subTxFreqKHz());
}

static void drawSubTxScreen() {
    const uint16_t bg = uiBg(), white = tft.color565(0xe8, 0xe8, 0xe0), gold = tft.color565(0xe7, 0xcf, 0x8f), red = tft.color565(0xff, 0x5a, 0x32);
    const Cc1101Spectrum::Band& b = cc.bandInfo();
    uint32_t fk = subTxFreqKHz();                   // actual TX freq (band centre, or 433.92 for the "full" band)
    uiHeaderRu(i18n::tr("Sub-GHz TX", "Тест-передача"), "CC1101");
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    tft.setTextDatum(TL_DATUM);
    fontSmall();
    tft.setTextColor(white, bg); tft.drawString(i18n::tr("Band:", "Диапазон:"), 10, 50);
    tft.setTextColor(gold, bg);  tft.drawString(i18n::isRu() ? b.ru : b.en, 96, 50);
    tft.setTextColor(white, bg); tft.drawString(i18n::tr("Freq:", "Частота:"), 10, 80);
    char fs[24]; snprintf(fs, sizeof(fs), "%lu.%02lu MHz", (unsigned long)(fk / 1000), (unsigned long)((fk % 1000) / 10));
    tft.setTextColor(gold, bg);  tft.drawString(fs, 96, 80);
    tft.setTextColor(white, bg); tft.drawString(i18n::tr("Power:", "Мощность:"), 10, 110);
    char ps[16]; snprintf(ps, sizeof(ps), "%d dBm", CC_PA_DBM[subPwrIdx]);
    tft.setTextColor(gold, bg);  tft.drawString(ps, 96, 110);
    fontBig();
    if (subTxOn) { tft.setTextColor(red, bg);  tft.drawString(i18n::tr("TRANSMITTING", "ПЕРЕДАЮ"), 10, 152); }
    else         { tft.setTextColor(gold, bg); tft.drawString(i18n::tr("Ready", "Готов"), 10, 152); }
    fontSmall(); tft.setTextColor(white, bg);
    tft.drawString(i18n::tr("Verify on external RX.", "Проверяй внешним RX."), 10, 194);
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back",
               subTxOn ? (i18n::isRu() ? "OK стоп  ▶ бэнд" : "OK stop  ▶ band")
                       : (i18n::isRu() ? "OK старт  ▶ бэнд" : "OK start  ▶ band"));
    fontOff();
}

static uint8_t subPowerCycle() {                    // max → … → min → wrap; persists; applied to the chip
    subPwrIdx = (subPwrIdx + 1) % CC_PA_N;
    cc.setTxPower(CC_PA[subPwrIdx]);
    saveSubPower(subPwrIdx);
    return CC_PA[subPwrIdx];
}

static void drawSubPowerInfo() {
    infoTitle = i18n::tr("Sub-GHz TX power", "Мощность Sub-GHz");
    infoBody  = String((int)CC_PA_DBM[subPwrIdx]) + i18n::tr(" dBm", " дБм") + (subPwrIdx == 0 ? i18n::tr(" (max)", " (макс)") : "");
    infoNote  = i18n::tr("Approx power of the Sub-GHz test signal (CC1101, ~10 mW max). Own equipment only.",
                         "Примерная мощность тестового сигнала Sub-GHz (CC1101, макс ~10 мВт). Только своё железо.");
    infoAction = F_SUBPOWER; st = ST_INFO; drawInfo();
}

// ---- Sub-GHz RAW recorder (CC1101) — own-equipment record + replay ----
static uint16_t recBuf[512];                        // captured OOK pulse durations (us)
static int      recN = 0;                            // pulses in the last capture (0 = empty)
static uint32_t recFreqKHz = 0;                      // frequency it was captured on (replay uses it)

static void drawSubRecScreen(const char* status = nullptr) {
    const uint16_t bg = uiBg(), white = tft.color565(0xe8, 0xe8, 0xe0), gold = tft.color565(0xe7, 0xcf, 0x8f), green = tft.color565(0x3f, 0xe0, 0x7a);
    const Cc1101Spectrum::Band& b = cc.bandInfo();
    uint32_t fk = subTxFreqKHz();
    uiHeaderRu(i18n::tr("Rec/Replay", "Запись-повтор"), "CC1101");
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    tft.setTextDatum(TL_DATUM);
    fontSmall();
    tft.setTextColor(white, bg); tft.drawString(i18n::tr("Band:", "Диапазон:"), 10, 50);
    tft.setTextColor(gold, bg);  tft.drawString(i18n::isRu() ? b.ru : b.en, 96, 50);
    tft.setTextColor(white, bg); tft.drawString(i18n::tr("Freq:", "Частота:"), 10, 78);
    char fs[24]; snprintf(fs, sizeof(fs), "%lu.%02lu MHz", (unsigned long)(fk / 1000), (unsigned long)((fk % 1000) / 10));
    tft.setTextColor(gold, bg);  tft.drawString(fs, 96, 78);
    fontBig();
    if (status) { tft.setTextColor(gold, bg); tft.drawString(status, 10, 118); }
    else if (recN > 0) { char cs[28]; snprintf(cs, sizeof(cs), "%s%d", i18n::tr("Saved: ", "Записано: "), recN); tft.setTextColor(green, bg); tft.drawString(cs, 10, 118); }
    else { tft.setTextColor(white, bg); tft.drawString(i18n::tr("Empty", "Пусто"), 10, 118); }
    fontSmall(); tft.setTextColor(white, bg);
    tft.drawString(i18n::tr("Own equipment only.", "Только своё железо."), 10, 152);
    tft.drawString(i18n::tr("OK record", "OK запись"), 10, 174);
    tft.drawString(i18n::tr("up replay", "вверх повтор"), 10, 196);
    tft.drawString(i18n::tr("down band", "вниз бэнд"), 10, 218);
    if (recN > 0) tft.drawString(i18n::tr("right save", "вправо сохранить"), 10, 240);   // only when there's a capture to save
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back", recN > 0 ? (i18n::isRu() ? "▶ сохранить" : "▶ save") : nullptr);
    fontOff();
}

static void subRecord() {
    loadSubCfg();                                       // apply current settings — playback may have changed cc's modulation
    char msg[24]; snprintf(msg, sizeof(msg), "%s%lus", i18n::tr("Listening ", "Слушаю "), (unsigned long)(recWaitMs / 1000));
    drawSubRecScreen(msg);
    recFreqKHz = subTxFreqKHz();
    cc.beginCapture(recFreqKHz);
    recN = cc.captureRaw(recBuf, 512, recWaitMs);
    drawSubRecScreen();
}

static void subReplay() {
    if (recN <= 0) return;
    drawSubRecScreen(i18n::tr("Replaying...", "Повтор…"));
    cc.setTxPower(CC_PA[subPwrIdx]);
    for (int r = 0; r < recRepeats; r++) {          // remotes send the frame repeated — replay N times
        cc.replayRaw(recBuf, recN, recFreqKHz);
        delay(20);
    }
    drawSubRecScreen();
}

