anton-vinogradov/esp32-leshy/src/main.cpp
// The hunter draws a live bar graph of how far each frequency RISES above a calibrated baseline.
// CALIB records the baseline (ambient + the chip's own crystal-harmonic birdies, e.g. 26 MHz*12 =
// 312 MHz) as the per-bin MIN over two passes; HUNT then max-holds the rise per bin, so a pressed
// tag builds a visible spike while constant spurs stay flat. You read the frequency off the peak —
// far more honest than an auto-pick that flip-flops on overload spurs and receiver harmonics.
enum HuntPhase { HP_CALIB, HP_HUNT };
static HuntPhase huntPhase = HP_CALIB;
static int8_t   huntBase[HUNT_MAXBINS];             // per-bin baseline RSSI (dBm)
static int8_t   huntRaw[HUNT_MAXBINS];              // this pass's raw rise above baseline (dB)
static int8_t   huntHold[HUNT_MAXBINS];             // per-bin max-held DRIFT-CORRECTED rise (dB), slow decay
static int      huntN = 0;                          // active bin count
static int      huntBin = 0;                        // sweep cursor (flat bin index)
static int      huntCalibPass = 0;                  // which baseline pass we're on
static bool     huntCalibrated = false;
static bool     huntLowGain = false;                // -18 dB input attenuation (near-field, anti-overload)
static uint32_t huntLastDraw = 0;

static int huntBinCount() {
    int n = 0;
    for (int w = 0; w < HUNT_NWIN; w++) n += (int)((HUNT_WINS[w].hi - HUNT_WINS[w].lo) / HUNT_STEP) + 1;
    return n;
}
static uint32_t huntBinFreq(int idx) {
    for (int w = 0; w < HUNT_NWIN; w++) {
        int n = (int)((HUNT_WINS[w].hi - HUNT_WINS[w].lo) / HUNT_STEP) + 1;
        if (idx < n) return HUNT_WINS[w].lo + (uint32_t)idx * HUNT_STEP;
        idx -= n;
    }
    return HUNT_WINS[HUNT_NWIN - 1].hi;
}
static int huntFreqBin(uint32_t f) {                // flat bin index nearest a frequency (-1 if in a gap)
    int base = 0;
    for (int w = 0; w < HUNT_NWIN; w++) {
        int n = (int)((HUNT_WINS[w].hi - HUNT_WINS[w].lo) / HUNT_STEP) + 1;
        if (f >= HUNT_WINS[w].lo && f <= HUNT_WINS[w].hi) return base + (int)((f - HUNT_WINS[w].lo + HUNT_STEP / 2) / HUNT_STEP);
        base += n;
    }
    return -1;
}

static const char* huntGuess(uint32_t k) {          // ISM/SRD band a real remote/tag would use (range-based)
    if (k >= 314000 && k <= 316000) return "315";
    if (k >= 386000 && k <= 392000) return "390";
    if (k >= 417000 && k <= 419000) return "418";
    if (k >= 433050 && k <= 434790) return "433 ISM";
    if (k >= 863000 && k <= 870000) return "868 ISM";
    if (k >= 902000 && k <= 928000) return "915 ISM";
    return "";
}

static bool huntIsSpur(uint32_t f) {                // near a crystal harmonic: 26 MHz (CC1101) or 40 MHz (ESP32)
    const uint32_t FX[] = { 26000, 40000 };
    for (uint32_t fx : FX) {
        uint32_t n = (f + fx / 2) / fx;
        uint32_t d = f > n * fx ? f - n * fx : n * fx - f;
        if (d <= 500) return true;
    }
    return false;
}

static void huntReset() {                           // (re)start with a fresh baseline calibration
    huntN = huntBinCount(); if (huntN > HUNT_MAXBINS) huntN = HUNT_MAXBINS;
    huntPhase = HP_CALIB; huntBin = 0; huntCalibPass = 0; huntCalibrated = false;
    for (int b = 0; b < huntN; b++) huntHold[b] = 0;
}

static void drawHuntChrome() {
    uiHeaderRu(i18n::tr("Freq finder", "Частотомер"), "CC1101");
    tft.fillRect(0, 28, 240, 320 - 28, uiBg());
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back", i18n::isRu() ? "▶ калибровать" : "▶ recal");
}

// Live readout (peak) + a rise-vs-frequency bar graph. You read the answer off the tall clean spike.
static const int HG_TOP = 120, HG_BOT = 250, HG_FS = 45;   // graph box (px) + full-scale dB
static void drawHuntGraph() {
    const uint16_t bg = uiBg(), white = tft.color565(0xe8, 0xe8, 0xe0), gold = tft.color565(0xe7, 0xcf, 0x8f),
                   green = tft.color565(0x3f, 0xe0, 0x7a), grayc = tft.color565(0x80, 0x88, 0x80),
                   dim = tft.color565(0x2c, 0x40, 0x30), axis = tft.color565(0x40, 0x50, 0x44);
    int peakBin = -1, peakRise = 0;                 // tallest held bin
    for (int b = 0; b < huntN; b++) if (huntHold[b] > peakRise) { peakRise = huntHold[b]; peakBin = b; }
    uint32_t peakKHz = peakBin >= 0 ? huntBinFreq(peakBin) : 0;

    // ---- readout ----
    tft.fillRect(0, 40, 240, HG_TOP - 44, bg);
    tft.setTextDatum(TL_DATUM);
    fontBig();
    if (!huntCalibrated) {
        tft.setTextColor(grayc, bg); tft.drawString(i18n::tr("calibrating...", "калибровка…"), 10, 46);
    } else if (peakRise >= HUNT_RISE && peakKHz) {
        char fs[16]; snprintf(fs, sizeof(fs), "%lu.%02lu", (unsigned long)(peakKHz / 1000), (unsigned long)((peakKHz % 1000) / 10));
        tft.setTextColor(green, bg); tft.drawString(fs, 10, 46);
        fontSmall(); tft.setTextColor(white, bg); tft.drawString(i18n::tr("MHz", "МГц"), 150, 62);
        const char* g = huntGuess(peakKHz);
        if (*g) { tft.setTextColor(gold, bg); tft.drawString(g, 182, 62); }
    } else {
        tft.setTextColor(grayc, bg); tft.drawString(i18n::tr("press the tag", "жми метку"), 10, 46);
    }
    fontSmall(); tft.setTextColor(white, bg);
    char l1[48];
    if (!huntCalibrated)            snprintf(l1, sizeof(l1), "%s", i18n::tr("don't press - measuring floor", "не жми — меряю фон"));
    else if (peakRise >= HUNT_RISE) snprintf(l1, sizeof(l1), "%s+%d dB", i18n::tr("peak rise ", "подъём пика "), peakRise);
    else                            snprintf(l1, sizeof(l1), "%s", i18n::tr("hold near antenna, press", "держи у антенны, жми"));
    tft.drawString(l1, 10, 96);
    if (huntLowGain) { tft.setTextColor(gold, bg); tft.drawString("-18 dB", 150, 46); }   // near-field attenuation on (OK toggles)
    fontOff();

    // ---- graph ----
    tft.fillRect(0, HG_TOP, 240, HG_BOT - HG_TOP + 14, bg);
    tft.drawFastHLine(0, HG_BOT, 240, axis);
    fontTiny(); tft.setTextDatum(TC_DATUM); tft.setTextColor(grayc, bg);   // ISM band ticks
    struct Tk { uint32_t f; const char* n; };
    static const Tk TKS[] = { {315000, "315"}, {433920, "433"}, {868350, "868"}, {915000, "915"} };
    for (const Tk& t : TKS) {
        int b = huntFreqBin(t.f); if (b < 0 || b >= huntN) continue;
        int x = b * 240 / huntN;
        tft.drawFastVLine(x, HG_BOT + 1, 3, axis);
        tft.drawString(t.n, x, HG_BOT + 4);
    }
    fontOff();
    for (int x = 0; x < 240; x++) {                 // bars: one column per screen x, max over its bins
        int b0 = x * huntN / 240, b1 = (x + 1) * huntN / 240; if (b1 <= b0) b1 = b0 + 1;
        int h = 0;
        for (int b = b0; b < b1 && b < huntN; b++) if (huntHold[b] > h) h = huntHold[b];
        int px = h * (HG_BOT - HG_TOP) / HG_FS; if (px > HG_BOT - HG_TOP) px = HG_BOT - HG_TOP;
        if (px > 0) tft.drawFastVLine(x, HG_BOT - px, px,
                        (peakBin >= b0 && peakBin < b1) ? gold : (h >= HUNT_RISE ? green : dim));
    }
}

static void huntTick() {
    const int BATCH = 16;                               // bounded work per loop() so buttons stay responsive
    if (huntPhase == HP_CALIB) {
        for (int i = 0; i < BATCH && huntBin < huntN; i++) {
            int dbm = cc.rssiAt(huntBinFreq(huntBin));
            int8_t v = (int8_t)(dbm < -128 ? -128 : (dbm > 0 ? 0 : dbm));
            huntBase[huntBin] = (huntCalibPass == 0 || v < huntBase[huntBin]) ? v : huntBase[huntBin];   // per-bin MIN across passes
            huntBin++;
        }
        if (huntBin >= huntN) {
            if (++huntCalibPass < HUNT_CALIB_PASSES) huntBin = 0;       // one more baseline pass (min rejects a stray press)
            else { huntCalibrated = true; huntPhase = HP_HUNT; huntBin = 0; }
        }
    } else {                                            // HP_HUNT — sweep raw rise, then drift-correct + max-hold
        for (int i = 0; i < BATCH && huntBin < huntN; i++) {
            uint32_t f = huntBinFreq(huntBin);
            if (huntIsSpur(f)) { huntRaw[huntBin] = 0; huntBin++; continue; }   // skip the chip's own crystal harmonics
            int rise = cc.rssiAt(f) - huntBase[huntBin];
            huntRaw[huntBin] = (int8_t)(rise < -120 ? -120 : (rise > 120 ? 120 : rise));
            huntBin++;
        }
        if (huntBin >= huntN) {                         // pass complete
            long sum = 0;                               // pass mean = global AGC/thermal drift; subtract it so only LOCAL peaks survive
            for (int b = 0; b < huntN; b++) sum += huntRaw[b];
            int mean = huntN ? (int)(sum / huntN) : 0;
            for (int b = 0; b < huntN; b++) {
                int adj = huntRaw[b] - mean; if (adj < 0) adj = 0;               // this bin's excess over the typical bin
                int dec = huntHold[b] - 3; if (dec < 0) dec = 0;                 // decay old spikes
                huntHold[b] = (int8_t)(adj > dec ? (adj > 120 ? 120 : adj) : dec);
            }
            huntBin = 0;
        }
    }
    if (millis() - huntLastDraw > 250) { huntLastDraw = millis(); drawHuntGraph(); }
}

// ---- 2.4 GHz frequency finder — same idea on the NRF24 (which channel lights up) ----
// The NRF24 gives only a 1-bit RPD per channel, so the "level" is a HIT-RATE: accumulate
// the RPD over H24_K sweeps → 0..K per channel. Baseline (min over 2 passes) captures the
// constant Wi-Fi/BT floor; a pressed tag/remote raises its channel's hit-rate above it.
static const int H24_N    = Nrf24Spectrum::CHANNELS;   // 126 channels, 2400 + ch MHz
static const int H24_K    = 48;                        // sweeps accumulated per pass
static const int H24_RISE = 8;                         // hit-rate rise above baseline to count as a signal
static const int H24_FS   = 36;                        // graph full-scale
enum Hunt24Phase { H24_CALIB, H24_HUNT };
static Hunt24Phase h24Phase = H24_CALIB;
static int8_t   h24Base[H24_N], h24Raw[H24_N], h24Hold[H24_N];
static int      h24Acc[H24_N];                         // this pass's per-channel hit accumulator
static int      h24Sweeps = 0, h24CalibPass = 0;
static bool     h24Calibrated = false;
static uint32_t h24LastDraw = 0;

static const char* hunt24Guess(int ch) {               // nearest Wi-Fi channel a peak overlaps
    static char buf[12];
    int w = (ch - 12 + 2) / 5 + 1;                     // Wi-Fi centres at nRF 12,17,22,... = 12+(w-1)*5
    if (w >= 1 && w <= 13 && abs(ch - (12 + (w - 1) * 5)) <= 6) { snprintf(buf, sizeof(buf), "Wi-Fi %d", w); return buf; }
    return "";
}

static void hunt24Reset() {
    h24Phase = H24_CALIB; h24CalibPass = 0; h24Calibrated = false; h24Sweeps = 0;
    for (int c = 0; c < H24_N; c++) { h24Acc[c] = 0; h24Hold[c] = 0; }
}

static void drawHunt24Chrome() {
    uiHeaderRu(i18n::tr("2.4 finder", "Частотомер 2.4"), "nRF24");
    tft.fillRect(0, 28, 240, 320 - 28, uiBg());
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back", i18n::isRu() ? "▶ калибровать" : "▶ recal");
}

static void drawHunt24Graph() {
    const uint16_t bg = uiBg(), white = tft.color565(0xe8, 0xe8, 0xe0), gold = tft.color565(0xe7, 0xcf, 0x8f),
                   green = tft.color565(0x3f, 0xe0, 0x7a), grayc = tft.color565(0x80, 0x88, 0x80),
                   dim = tft.color565(0x2c, 0x40, 0x30), axis = tft.color565(0x40, 0x50, 0x44);
    int peakCh = -1, peakRise = 0;
    for (int c = 0; c < H24_N; c++) if (h24Hold[c] > peakRise) { peakRise = h24Hold[c]; peakCh = c; }

    tft.fillRect(0, 40, 240, HG_TOP - 44, bg);          // reuse the sub-GHz graph box geometry (HG_TOP/HG_BOT)
    tft.setTextDatum(TL_DATUM);
    fontBig();
    if (!h24Calibrated) {
        tft.setTextColor(grayc, bg); tft.drawString(i18n::tr("calibrating...", "калибровка…"), 10, 46);
    } else if (peakRise >= H24_RISE && peakCh >= 0) {
        char fs[16]; snprintf(fs, sizeof(fs), "%d", 2400 + peakCh);
        tft.setTextColor(green, bg); tft.drawString(fs, 10, 46);
        fontSmall(); tft.setTextColor(white, bg); tft.drawString(i18n::tr("MHz", "МГц"), 120, 62);
        const char* g = hunt24Guess(peakCh);
        if (*g) { tft.setTextColor(gold, bg); tft.drawString(g, 160, 62); }
    } else {
        tft.setTextColor(grayc, bg); tft.drawString(i18n::tr("press the tag", "жми метку"), 10, 46);
    }
    fontSmall(); tft.setTextColor(white, bg);
    char l1[48];
    if (!h24Calibrated)            snprintf(l1, sizeof(l1), "%s", i18n::tr("don't press - measuring floor", "не жми — меряю фон"));
    else if (peakRise >= H24_RISE) snprintf(l1, sizeof(l1), "%s+%d", i18n::tr("peak rise ", "подъём пика "), peakRise);
    else                           snprintf(l1, sizeof(l1), "%s", i18n::tr("hold near antennas, press", "держи у антенн, жми"));
    tft.drawString(l1, 10, 96);
    fontOff();

    tft.fillRect(0, HG_TOP, 240, HG_BOT - HG_TOP + 14, bg);
    tft.drawFastHLine(0, HG_BOT, 240, axis);
    fontTiny(); tft.setTextDatum(TC_DATUM); tft.setTextColor(grayc, bg);   // Wi-Fi 1/6/11 landmarks
    const int WCH[] = { 1, 6, 11 };
    for (int wi = 0; wi < 3; wi++) {
        int ch = 12 + (WCH[wi] - 1) * 5, x = ch * 240 / H24_N;
        tft.drawFastVLine(x, HG_BOT + 1, 3, axis);
        char b[4]; snprintf(b, sizeof(b), "%d", WCH[wi]); tft.drawString(b, x, HG_BOT + 4);
    }
    fontOff();
    for (int c = 0; c < H24_N; c++) {                   // one bar per channel
        int x0 = c * 240 / H24_N, x1 = (c + 1) * 240 / H24_N; if (x1 <= x0) x1 = x0 + 1;
        int px = h24Hold[c] * (HG_BOT - HG_TOP) / H24_FS; if (px > HG_BOT - HG_TOP) px = HG_BOT - HG_TOP;
        if (px > 0) tft.fillRect(x0, HG_BOT - px, x1 - x0, px, c == peakCh ? gold : (h24Hold[c] >= H24_RISE ? green : dim));
    }
}

