anton-vinogradov/esp32-leshy/src/main.cpp
static void hunt24Tick() {
    uint8_t sw[H24_N];
    for (int s = 0; s < 2 && h24Sweeps < H24_K; s++) {  // accumulate a couple of RPD sweeps per loop
        nrf.sweep(sw);
        for (int c = 0; c < H24_N; c++) h24Acc[c] += (sw[c] & 1);
        h24Sweeps++;
    }
    if (h24Sweeps >= H24_K) {                           // pass complete → h24Acc[c] = hit-rate 0..K
        if (h24Phase == H24_CALIB) {
            for (int c = 0; c < H24_N; c++) {
                int8_t v = (int8_t)h24Acc[c];
                h24Base[c] = (h24CalibPass == 0 || v < h24Base[c]) ? v : h24Base[c];   // per-channel MIN
            }
            if (++h24CalibPass >= HUNT_CALIB_PASSES) { h24Calibrated = true; h24Phase = H24_HUNT; }
        } else {
            long sum = 0;
            for (int c = 0; c < H24_N; c++) { h24Raw[c] = (int8_t)(h24Acc[c] - h24Base[c]); sum += h24Raw[c]; }
            int mean = (int)(sum / H24_N);              // subtract the pass mean (drift/overall-busy) → local peaks survive
            for (int c = 0; c < H24_N; c++) {
                int adj = h24Raw[c] - mean; if (adj < 0) adj = 0;
                int dec = h24Hold[c] - 2; if (dec < 0) dec = 0;
                h24Hold[c] = (int8_t)(adj > dec ? adj : dec);
            }
        }
        for (int c = 0; c < H24_N; c++) h24Acc[c] = 0;
        h24Sweeps = 0;
    }
    if (millis() - h24LastDraw > 250) { h24LastDraw = millis(); drawHunt24Graph(); }
}

static void drawSubCfgScreen() {
    const uint16_t bg = uiBg(), white = tft.color565(0xe8, 0xe8, 0xe0), gold = tft.color565(0xe7, 0xcf, 0x8f);
    uiHeaderRu(i18n::tr("Sub-GHz setup", "Настройки Sub-GHz"));
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    tft.setTextDatum(TL_DATUM);
    fontSmall(); tft.setTextColor(white, bg);
    tft.drawString(i18n::tr("1. Join this Wi-Fi:", "1. Подключись к сети:"), 10, 50);
    tft.setTextColor(gold, bg);  tft.drawString(SubCfg::apName(), 10, 74);
    tft.setTextColor(white, bg);
    tft.drawString(i18n::tr("2. Set the fields, save.", "2. Задай поля, сохрани."), 10, 108);
    fontBig();
    if (!subcfg.isRunning()) { tft.setTextColor(tft.color565(0x3f, 0xe0, 0x7a), bg); tft.drawString(i18n::tr("Saved.", "Сохранено."), 10, 150); }
    else if (subcfg.saved()) { tft.setTextColor(tft.color565(0x3f, 0xe0, 0x7a), bg); tft.drawString(i18n::tr("Got it!", "Принял!"), 10, 150); }
    else { tft.setTextColor(gold, bg); tft.drawString(i18n::tr("Waiting...", "Жду…"), 10, 150); }
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back");
    fontOff();
}

// ---- Wi-Fi scan selection + per-network options ----
static void ensureWifiVisible() {
    int n = engine.wifiCount();
    if (wifiSel > n - 1) wifiSel = n - 1;
    if (wifiSel < 0) wifiSel = 0;
    if (wifiSel < off) off = wifiSel;
    if (wifiSel >= off + UI_VISIBLE) off = wifiSel - UI_VISIBLE + 1;
    if (off < 0) off = 0;
}

static void gotoWifi() {
    if (scanPausedAt && millis() - scanPausedAt > 5000) engine.clearSparks();  // long gap → the graph would splice two sessions into one line
    scanPausedAt = 0;
    engine.setMode(ScanEngine::SCAN_WIFI); engine.resume();
    st = ST_WIFI; seenWifiGen = engine.wifiGen();
    ensureWifiVisible();
    tft.fillRect(0, 28, 240, 320 - 28, uiBg());   // clear the canvas once on entry; ticks repaint rows only
    drawList(true);
}

static void openNetOptions() {
    if (!engine.wifiRow(wifiSel, netSel)) return;
    engine.pause();                          // freeze the scan while the menu is open
    scanPausedAt = millis();                 // remember when, so a long detour resets the RSSI graph on return
    String mine; bool isMine = net.isMine(netSel.bssid, mine);
    optTitle = netSel.ssid.length() ? netSel.ssid : (isMine ? mine : String(i18n::tr("<hidden>", "<скрытая>")));
    optN = 0;
    optLabels[optN] = i18n::tr("Details", "Подробнее"); optIds[optN] = OPT_NET_DETAILS; optN++;
    optSel = 0; optReturn = ST_WIFI;
    st = ST_OPTIONS; drawOptionsScreen();
}

static void drawNetDetails() {
    const uint16_t bg = uiBg();
    const uint16_t white = tft.color565(0xe8, 0xe8, 0xe0);
    const uint16_t dim   = tft.color565(0x8f, 0xa9, 0x8f);
    const uint16_t gold  = tft.color565(0xff, 0xcf, 0x3f);
    String mine; bool isMine = net.isMine(netSel.bssid, mine);
    bool named = netSel.ssid.length() > 0;
    String name = named ? netSel.ssid : (isMine ? mine : String(i18n::tr("<hidden>", "<скрытая>")));
    uiHeaderRu(i18n::tr("Network", "Сеть"));
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    fontSmall(); tft.setTextDatum(TL_DATUM);
    int y = 46;
    tft.setTextColor(dim, bg);  tft.drawString(i18n::tr("Name", "Имя"), 14, y); y += 22;
    tft.setTextColor(isMine ? gold : white, bg);
    tft.drawString((isMine ? String("* ") : String("")) + name, 22, y); y += 30;
    char mac[18];
    snprintf(mac, sizeof(mac), "%02X:%02X:%02X:%02X:%02X:%02X", netSel.bssid[0], netSel.bssid[1], netSel.bssid[2], netSel.bssid[3], netSel.bssid[4], netSel.bssid[5]);
    tft.setTextColor(dim, bg); tft.drawString("BSSID", 14, y); y += 20;
    fontOff(); tft.setTextColor(white, bg); tft.drawString(mac, 22, y, 2); fontSmall(); y += 30;
    tft.setTextColor(dim, bg); tft.drawString(i18n::tr("Channel", "Канал"), 14, y);
    tft.setTextDatum(TR_DATUM); tft.setTextColor(white, bg); tft.drawString(String(netSel.channel), 226, y); tft.setTextDatum(TL_DATUM); y += 24;
    tft.setTextColor(dim, bg); tft.drawString("RSSI", 14, y);
    tft.setTextDatum(TR_DATUM); tft.setTextColor(white, bg); tft.drawString(String(netSel.rssi) + " dBm", 226, y); tft.setTextDatum(TL_DATUM); y += 24;
    tft.setTextColor(dim, bg); tft.drawString(i18n::tr("Security", "Шифр"), 14, y);
    tft.setTextDatum(TR_DATUM); tft.setTextColor(white, bg); tft.drawString(WifiScanner::authName(netSel.auth), 226, y); tft.setTextDatum(TL_DATUM); y += 26;
    if (netSel.hidden) { tft.setTextColor(tft.color565(0xff, 0xa5, 0x2a), bg); tft.drawString(i18n::tr("hidden network", "скрытая сеть"), 14, y); }
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back");
    fontOff();
    drawNetBadge();
}

