anton-vinogradov/esp32-leshy/src/main.cpp
// ---- Responsible-use notice: full text, scrollable, must be read to the end ----
static const int LEG_TOP = 34, LEG_LH = 15, LEG_LINES = 17;   // visible text lines
static String  legLines[220];                                  // wrapped lines
static int     legN = 0, legOff = 0;
static bool    legAccepted = false;      // read to the end in this viewing
static bool    legFirstRun = false;      // gate at boot (must accept once)

static bool legalSeen() { Preferences p; p.begin("leshy", true); bool v = p.getBool("legal_ok", false); p.end(); return v; }
static void legalMarkSeen() { Preferences p; p.begin("leshy", false); p.putBool("legal_ok", true); p.end(); }

static void legalWrap() {                 // wrap the doc into display lines (smooth font metrics)
    const LegalDoc& d = i18n::isRu() ? LEGAL_DOC_RU : LEGAL_DOC_EN;
    fontTiny();
    legN = 0; legOff = 0; legAccepted = false;
    for (int i = 0; i < d.n && legN < 218; i++) {
        String par = d.p[i];
        if (par.length() == 0) { legLines[legN++] = ""; continue; }
        bool head = par.startsWith("#");
        if (head) par = par.substring(2);
        String cur, word;
        for (int k = 0; k <= (int)par.length(); k++) {
            char c = (k < (int)par.length()) ? par[k] : ' ';
            if (c == ' ') {
                String test = cur.length() ? cur + " " + word : word;
                if (tft.textWidth(test) > 222 && cur.length()) { legLines[legN++] = (head ? "#" : "") + cur; cur = word; }
                else cur = test;
                word = "";
                if (legN >= 218) break;
            } else word += c;
        }
        if (cur.length() && legN < 218) legLines[legN++] = (head ? "#" : "") + cur;
    }
    fontOff();
}

static void drawLegalScreen() {
    const uint16_t bg = uiBg();
    const uint16_t white = tft.color565(0xe8, 0xe8, 0xe0);
    const uint16_t gold  = tft.color565(0xff, 0xcf, 0x3f);
    const uint16_t dim   = tft.color565(0x8f, 0xa9, 0x8f);
    int maxOff = legN - LEG_LINES; if (maxOff < 0) maxOff = 0;
    if (legOff >= maxOff) legAccepted = true;         // scrolled to the end = read
    char pct[12]; snprintf(pct, sizeof(pct), "%d%%", maxOff ? (legOff * 100 / maxOff) : 100);
    uiHeaderRu(i18n::tr("Responsible use", "Ответственность"), pct);
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    fontTiny();
    tft.setTextDatum(TL_DATUM);
    for (int i = 0; i < LEG_LINES; i++) {
        int idx = legOff + i;
        if (idx >= legN) break;
        String ln = legLines[idx];
        bool head = ln.startsWith("#");
        if (head) ln = ln.substring(1);
        tft.setTextColor(head ? gold : white, bg);
        tft.drawString(ln, 9, LEG_TOP + i * LEG_LH);
    }
    if (legFirstRun)
        uiFooterRu(legAccepted ? (i18n::isRu() ? "OK — принимаю" : "OK — I accept")
                               : (i18n::isRu() ? "листай вниз" : "scroll down"),
                   legAccepted ? "" : (i18n::isRu() ? "до конца ▼" : "to the end ▼"));
    else
        uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back", i18n::isRu() ? "листай ▼" : "scroll ▼");
    fontOff();
}

static void gotoLegal(bool firstRun) {
    legFirstRun = firstRun;
    legalWrap();
    st = ST_LEGAL;
    drawLegalScreen();
}

// First boot: pick the language, then the notice must be read before anything else.
static const char* const LANGPICK[] = { "English", "Русский" };
static int langPickSel = 1;

static void drawLangPick() {
    const uint16_t bg = uiBg();
    const uint16_t gold = tft.color565(0xff, 0xcf, 0x3f);
    uiHeaderRu("ESP32-Leshy");
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    fontSmall();
    tft.setTextDatum(MC_DATUM);
    tft.setTextColor(gold, bg);
    tft.drawString("Language / Язык", 120, 70);
    fontOff();
    for (int i = 0; i < 2; i++) drawActionBtn(120 + i * 48, LANGPICK[i], i == langPickSel);
    uiFooterRu("", "OK ▶");
}

static void back() {
    switch (st) {
        case ST_LANGPICK:  return;                                         // no way out before choosing
        case ST_LEGAL:     if (legFirstRun) return;                        // must accept on first run
                           showMenu();                                     return;
        case ST_DEAUTH:    detector.stop(); showMenu();                    return;
        case ST_CHANNELS:  airtime.stop(); showMenu();                     return;
        case ST_SPECTRUM:  spectrumStop(); showMenu();                     return;
        case ST_HUNT24:    nrf.end(); showMenu();                          return;
        case ST_SUBSPECTRUM: subStop(); showMenu();                        return;
        case ST_SUBTX:     subTxOn = false; cc.end(); showMenu();          return;
        case ST_SUBREC:    cc.end(); showMenu();                           return;
        case ST_KEYBOARD:  st = ST_SUBREC; drawSubRecScreen();             return;   // naming is part of the record flow — keep CC1101 (touch-on-header path)
        case ST_REC_PLAY:  cc.end(); showMenu();                           return;
        case ST_SUBHUNT:   cc.end(); showMenu();                           return;
        case ST_SUBCFG:    subcfg.stop(); showMenu();                      return;
        case ST_POLITE:    portal.stop(); showMenu();                      return;
        case ST_NETINFO:   gotoWifi();                                     return;
        case ST_OTA:       if (ota.busy()) return;   // checking or downloading — stay put
                           showMenu();                                     return;
        case ST_PROVISION: net.stopProvision(); gotoConn();               return;
        case ST_CONFIRM:   cancelConfirm();                               return;
        case ST_OPTIONS:   if (optReturn == ST_HIDDEN) gotoHidden(); else if (optReturn == ST_WIFI) gotoWifi(); else showMenu(); return;
        case ST_MENU:      if (depth > 0) { depth--; showMenu(); }        return;
        default:           showMenu();                                    return;  // WIFI/BLE/INFO/CONN/HIDDEN
    }
}

static void launch(int feat) {
    // An OTA check/download owns the radio — never start a screen that touches it.
    if (ota.busy() && feat != F_OTA) return;
    if (st == ST_DEAUTH)    detector.stop();       // release promiscuous before anything else
    if (st == ST_CHANNELS)  airtime.stop();        // also promiscuous
    if (st == ST_SPECTRUM)  spectrumStop();        // release NRF24
    if (st == ST_HUNT24)    nrf.end();             // release NRF24
    if (st == ST_SUBSPECTRUM) subStop();           // release CC1101
    if (st == ST_SUBTX)     { subTxOn = false; cc.end(); }   // stop TX + release CC1101
    if (st == ST_SUBREC)    cc.end();              // release CC1101
    if (st == ST_KEYBOARD)  cc.end();              // naming screen was reached with CC1101 up
    if (st == ST_REC_PLAY)  cc.end();              // release CC1101
    if (st == ST_SUBHUNT)   cc.end();              // release CC1101
    if (st == ST_SUBCFG)    subcfg.stop();         // drop the settings SoftAP
    if (st == ST_POLITE)    portal.stop();         // drop the captive-portal SoftAP
    if (st == ST_PROVISION) net.stopProvision();   // drop the SoftAP + portal
    engine.pause();                                // scanning is off unless the target feature turns it back on
    infoAction = -1;                               // most info screens aren't adjustable; the two that are set this
    switch (feat) {
        case F_WIFI_SCAN:   wifiSel = 0; off = 0; engine.clearSparks(); gotoWifi(); break;
        case F_CONN:        connSel = 0; gotoConn(); break;
        case F_HIDDEN:      hidSel = 0; hidOff = 0; gotoHidden(); break;
        case F_DEAUTH:      engine.pauseAndWait();     // promiscuous needs the radio to itself
                            if (detector.begin()) { st = ST_DEAUTH; drawDeauthScreen(); }
                            else { infoTitle = i18n::tr("Deauth monitor", "Детектор атак"); infoBody = i18n::tr("Radio busy", "Радио занято"); infoNote = ""; st = ST_INFO; drawInfo(); }
                            break;
        case F_CHANNELS:    engine.pauseAndWait();          // airtime needs the radio to itself (promiscuous)
                            if (airtime.begin()) { st = ST_CHANNELS; memset(chHist, 0, sizeof(chHist)); chHead = 0; drawChannelScreen(); }
                            else { infoTitle = i18n::tr("Channels 2.4G", "Каналы 2.4ГГц"); infoBody = i18n::tr("Radio busy", "Радио занято"); infoNote = ""; st = ST_INFO; drawInfo(); }
                            break;
        case F_SPECTRUM:    engine.pause();                 // NRF24 is a separate SPI radio; free the ESP radio's CPU load anyway
                            spLab = false; spTxOn = false; spTxMask = 0; spSweep = false; spRightPending = false;   // passive viewer — never transmits
                            if (nrf.begin()) { st = ST_SPECTRUM; drawSpectrumScreen(); }
                            else { infoTitle = i18n::tr("2.4GHz Spectrum", "Спектр 2.4ГГц"); infoBody = i18n::tr("NRF24 not found", "NRF24 не найден");
                                   infoNote = i18n::tr("This build expects an NRF24 module in slot 2.", "Нужен модуль NRF24 в слоте 2."); st = ST_INFO; drawInfo(); }
                            break;
        case F_HUNT24:      engine.pause();                 // 2.4 GHz frequency finder — pure RX (RPD hit-rate)
                            if (nrf.begin()) { nrf.setTxWifiMask(0); hunt24Reset(); st = ST_HUNT24; drawHunt24Chrome(); drawHunt24Graph(); }
                            else { infoTitle = i18n::tr("2.4 finder", "Частотомер 2.4"); infoBody = i18n::tr("NRF24 not found", "NRF24 не найден");
                                   infoNote = i18n::tr("This build expects an NRF24 module in slot 2.", "Нужен модуль NRF24 в слоте 2."); st = ST_INFO; drawInfo(); }
                            break;
        case F_NOISEGEN:    engine.pause();
                            spLab = true; spTxOn = false; spCursor = 6; spSweep = false; spRightPending = false;
                            spTxMask = (1 << 1) | (1 << 6) | (1 << 11);    // preset the non-overlapping channels, ready to fire
                            if (nrf.begin()) { st = ST_SPECTRUM; drawSpectrumScreen(); }
                            else { infoTitle = i18n::tr("Generator", "Генератор"); infoBody = i18n::tr("NRF24 not found", "NRF24 не найден");
                                   infoNote = i18n::tr("This build expects an NRF24 module in slot 2.", "Нужен модуль NRF24 в слоте 2."); st = ST_INFO; drawInfo(); }
                            break;
        case F_TXMODE:      drawTxModeInfo(); break;
        case F_PORTAL_CFG:{ engine.pauseAndWait();                 // setup network to name the portal AP
                            PolitePortalConfig cfg;
                            cfg.setup        = true;
                            cfg.portalSsid   = "Leshy-portal-setup";   // the setup network's own name
                            cfg.setupCurrent = net.labApName();        // prefill the form with the saved name
                            cfg.channel      = 6;
                            if (portal.begin(cfg)) { portalSetup = true; portalSaved = false; politePhase = 0; st = ST_POLITE; drawPoliteScreen(); }
                            else { infoTitle = i18n::tr("Portal setup", "Настройка портала"); infoBody = i18n::tr("Failed to start", "Не удалось запустить"); infoNote = ""; st = ST_INFO; drawInfo(); }
                            break; }
        case F_POLITE:    { engine.pauseAndWait();                 // raise our own named AP with the consent page
                            PolitePortalConfig cfg;
                            cfg.targetSsid = "";                   // consent mode — stop on the button
                            cfg.portalSsid = net.labApName();
                            cfg.channel    = 6;
                            if (portal.begin(cfg)) { portalSetup = false; portalSaved = false; politePhase = 0; st = ST_POLITE; drawPoliteScreen(); }
                            else { infoTitle = i18n::tr("Captive portal", "Captive-портал"); infoBody = i18n::tr("Failed to start", "Не удалось запустить"); infoNote = ""; st = ST_INFO; drawInfo(); }
                            break; }
        case F_SUBSPECTRUM: engine.pause();
                            if (cc.begin()) { cc.setBand(0); st = ST_SUBSPECTRUM; drawSubScreen(); }
                            else { infoTitle = i18n::tr("Sub-GHz Spectrum", "Спектр Sub-GHz"); infoBody = i18n::tr("CC1101 not found", "CC1101 не найден");
                                   infoNote = i18n::tr("This build expects a CC1101 sub-GHz module.", "Нужен модуль CC1101."); st = ST_INFO; drawInfo(); }
                            break;
        case F_SUBTX:       engine.pause(); subTxOn = false;
                            if (cc.begin()) { cc.setBand(2); st = ST_SUBTX; drawSubTxScreen(); }   // default to the 433 band
                            else { infoTitle = i18n::tr("Sub-GHz TX", "Тест-передача"); infoBody = i18n::tr("CC1101 not found", "CC1101 не найден");
                                   infoNote = i18n::tr("This build expects a CC1101 sub-GHz module.", "Нужен модуль CC1101."); st = ST_INFO; drawInfo(); }
                            break;
        case F_SUBPOWER:    drawSubPowerInfo(); break;
        case F_SUBREC:      engine.pause(); recN = 0;
                            if (cc.begin()) { cc.setBand(2); st = ST_SUBREC; drawSubRecScreen(); }   // default 433
                            else { infoTitle = i18n::tr("Sub-GHz Rec", "Запись Sub-GHz"); infoBody = i18n::tr("CC1101 not found", "CC1101 не найден");
                                   infoNote = i18n::tr("This build expects a CC1101 sub-GHz module.", "Нужен модуль CC1101."); st = ST_INFO; drawInfo(); }
                            break;
        case F_SUBCFG:      engine.pauseAndWait();                 // settings portal owns the radio (SoftAP)
                            if (subcfg.begin()) { subCfgPhase = 0; st = ST_SUBCFG; drawSubCfgScreen(); }
                            else { infoTitle = i18n::tr("Sub-GHz setup", "Настройки Sub-GHz"); infoBody = i18n::tr("Failed to start", "Не удалось запустить"); infoNote = ""; st = ST_INFO; drawInfo(); }
                            break;
        case F_SUBHUNT:     engine.pause();                        // frequency hunter — pure RX sweep
                            if (cc.begin()) { cc.setRxGain(huntLowGain); huntReset(); st = ST_SUBHUNT; drawHuntChrome(); drawHuntGraph(); }
                            else { infoTitle = i18n::tr("Freq finder", "Частотомер"); infoBody = i18n::tr("CC1101 not found", "CC1101 не найден");
                                   infoNote = i18n::tr("This build expects a CC1101 sub-GHz module.", "Нужен модуль CC1101."); st = ST_INFO; drawInfo(); }
                            break;
        case F_REC_PLAY:    engine.pause();                        // browse + replay the saved library (CC1101 for TX)
                            if (cc.begin()) { recCount = RecStore::list(recNames, RecStore::MAX_RECS); recSel = 0; recOff = 0; recDelArm = false; st = ST_REC_PLAY; drawRecPlayScreen(); }
                            else { infoTitle = i18n::tr("Playback", "Воспроизведение"); infoBody = i18n::tr("CC1101 not found", "CC1101 не найден");
                                   infoNote = i18n::tr("This build expects a CC1101 sub-GHz module.", "Нужен модуль CC1101."); st = ST_INFO; drawInfo(); }
                            break;
        case F_BLE_SCAN:    engine.setMode(ScanEngine::SCAN_BLE);  engine.resume(); st = ST_BLE;  off = 0; seenBleGen  = engine.bleGen();
                            tft.fillRect(0, 28, 240, 320 - 28, uiBg()); drawList(true); break;
        case F_SUBGHZ_SOON: infoTitle = i18n::tr("Sub-GHz Recorder", "Запись Sub-GHz"); infoBody = i18n::tr("Record / replay 315-868 MHz", "Запись/повтор 315-868 МГц"); infoNote = i18n::tr("Coming soon (needs CC1101)", "Скоро (нужен CC1101)"); st = ST_INFO; drawInfo(); break;
        case F_ABOUT:       st = ST_INFO; drawAboutScreen(); break;
        case F_LEGAL:       gotoLegal(false); break;
        case F_OTA:         gotoOta(); break;
        case F_LEDS:        drawLedsInfo(); break;         // shows current; SELECT/RIGHT cycles in place
        case F_BACKLIGHT:   drawBacklightInfo(); break;
        case F_TXPOWER:     drawTxPowerInfo(); break;
        case F_RECAL:       touchRecalibrate(); showMenu(); break;
        case F_LANG_EN:     i18n::set(Lang::EN); saveLang(Lang::EN); if (depth > 0) depth--; showMenu(); break;
        case F_LANG_RU:     i18n::set(Lang::RU); saveLang(Lang::RU); if (depth > 0) depth--; showMenu(); break;
    }
}

static void activate() {
    const MenuItem& it = MENUS[curMenu()].items[curSel()];
    if (it.kind == K_SUB) { depth++; menuStack[depth] = it.target; selStack[depth] = 0; showMenu(); }
    else launch(it.target);
}

