anton-vinogradov/esp32-leshy/src/main.cpp
void loop() {
    // ---- touch (edge-triggered) ----
    uint16_t tx, ty;
    if (touchGet(tx, ty)) {
        if (!touchDown) {
            touchDown = true;
            if (st == ST_LANGPICK) {
                for (int i = 0; i < 2; i++)
                    if (ty >= 120 + i * 48 && ty < 120 + i * 48 + 34) {
                        langPickSel = i; Lang l = i ? Lang::RU : Lang::EN;
                        i18n::set(l); saveLang(l); gotoLegal(true); break;
                    }
            } else if (st == ST_LEGAL) {
                if (ty > 260) { int m = legN - LEG_LINES; if (m < 0) m = 0;   // tap low = scroll on
                                if (legOff < m) { legOff += 4; if (legOff > m) legOff = m; drawLegalScreen(); }
                                else if (legFirstRun && legAccepted) { legalMarkSeen(); legFirstRun = false; depth = 0; showMenu(); }
                                else if (!legFirstRun) showMenu(); }
                else if (ty < 60 && legOff > 0) { legOff -= 4; if (legOff < 0) legOff = 0; drawLegalScreen(); }
            } else if (st == ST_MENU) {
                int hit = menuScreen.hitTest(tx, ty);
                if (hit >= 0) { int p = curSel(); curSel() = hit; menuScreen.repaint(p, hit); activate(); }
            } else if (st == ST_CONN) {
                if (ty < 28) back();
                else for (int i = 0; i < connActN; i++)
                    if (ty >= connActY[i] && ty < connActY[i] + 34) { connSel = i; connActivate(); break; }
            } else if (st == ST_HIDDEN) {
                if (ty < 28) back();
                else for (int i = 0; i < HID_VISIBLE; i++)
                    if (hidRowY[i] >= 0 && ty >= hidRowY[i] && ty < hidRowY[i] + HID_ROW_H) { hidSel = hidOff + i; openHiddenOptions(); break; }
            } else if (st == ST_OPTIONS) {
                if (ty < 28) back();
                else for (int i = 0; i < optN; i++)
                    if (ty >= optY[i] && ty < optY[i] + 34) { optSel = i; optActivate(); break; }
            } else if (st == ST_WIFI) {
                if (ty < 28) back();
                else { int i = (ty - UI_LIST_TOP) / UI_ROW_H; int idx = off + i;
                       if (i >= 0 && i < UI_VISIBLE && idx < engine.wifiCount()) { wifiSel = idx; ensureWifiVisible(); openNetOptions(); } }
            } else if (st == ST_OTA) {
                if (ota.phase() == OtaManager::AVAILABLE) ota.startUpdate();
                else if (ota.phase() != OtaManager::DOWNLOADING && ty < 60) back();
            } else if (st == ST_CONFIRM) {
                if (ty >= okBtnY && ty < okBtnY + 40) doConfirm();
                else if (ty >= cancelBtnY && ty < cancelBtnY + 40) cancelConfirm();
                else if (ty < 28) cancelConfirm();
            } else if (ty < 28) {           // WIFI / BLE / INFO / PROVISION: tap header to go back
                back();
            }
        }
    } else {
        touchDown = false;
    }

    // ---- keypad + serial remote ----
    onKey(buttons.poll());
    serialControl();

    // ---- status LEDs: derive "what the radio is doing" from one place, so no
    //      screen transition can forget to update them ----
    leds.set(ota.busy()                            ? StatusLeds::OTA
           : (st == ST_PROVISION || (st == ST_POLITE && portal.isRunning()) || st == ST_SUBCFG) ? StatusLeds::PORTAL
           : st == ST_DEAUTH                       ? StatusLeds::PROMISC
           : (st == ST_WIFI || st == ST_CHANNELS || st == ST_SPECTRUM || st == ST_HUNT24) ? StatusLeds::WIFI_SCAN
           : st == ST_SUBSPECTRUM                  ? StatusLeds::PROMISC
           : st == ST_BLE                          ? StatusLeds::BLE_SCAN
           : (st == ST_OTA && ota.phase() == OtaManager::FAILED) ? StatusLeds::ERR
                                                   : StatusLeds::IDLE);
    // An antenna emitting noise (spectrum TX) lights its own LED yellow: NRF slot i sits
    // under LED i+1 (LED 0 is the sub-GHz antenna), so shift the slot mask up by one.
    uint8_t txLeds = (st == ST_SPECTRUM && nrf.txActive()) ? (uint8_t)(nrf.txSlotMask() << 1)
                   : (st == ST_SUBTX && subTxOn)           ? (uint8_t)0x01     // sub-GHz antenna = LED 0
                                                           : 0;
    leds.setTx(txLeds);
    leds.tick();

    // ---- deauth monitor: hop channels + refresh stats ----
    if (st == ST_DEAUTH) {
        detector.loop();
        static uint32_t nextDeauthDraw = 0;
        if (millis() - nextDeauthDraw > 400) { nextDeauthDraw = millis(); deauthRefresh(); }
    }

    // ---- provisioning portal ----
    if (st == ST_PROVISION) {
        net.loopProvision();
        if (net.pendingConnect()) {
            net.stopProvision();     // saves creds + switches to STA (AP drops)
            infoTitle = i18n::tr("Connecting...", "Подключение..."); infoBody = net.savedSsid(); infoNote = ""; infoAction = -1;
            st = ST_INFO; drawInfo();
            net.connect();
            if (net.connected()) ota.startCheck();   // auto-check for updates on connect
            gotoConn();              // land on the connection screen with the fresh status
        }
    }

    // ---- live updates ----
    if (st == ST_WIFI && engine.wifiGen() != seenWifiGen) {
        seenWifiGen = engine.wifiGen();
        ensureWifiVisible();
        drawList(true);
    } else if (st == ST_BLE && engine.bleGen() != seenBleGen) {
        seenBleGen = engine.bleGen();
        int m = engine.bleCount() - UI_VISIBLE; if (m < 0) m = 0; if (off > m) off = m;
        drawList(true);
    } else if (st == ST_OTA && ota.gen() != seenOtaGen) {
        seenOtaGen = ota.gen();
        if ((int)ota.phase() != seenOtaPhase) { seenOtaPhase = (int)ota.phase(); drawOtaScreen(); }
        else otaBar();                       // % change → repaint just the slider (no bg redraw)
    }

    // Channel graphs scroll on a steady tick (cardiograph feel) from real airtime.
    if (st == ST_CHANNELS) {
        airtime.loop();             // hop channels; each is refreshed as the sweep visits it
        static uint32_t nextCh = 0;
        if (millis() - nextCh > 120) {
            nextCh = millis();
            channelSample();
            channelGraphs();        // header/footer untouched — no flicker
        }
    }

