anton-vinogradov/esp32-leshy/src/main.cpp
    // 2.4GHz spectrum waterfall
    if (st == ST_POLITE) {
        portal.loop();
        if (portalSetup && portal.nameSubmitted() && !portalSaved) {
            net.saveLabApName(portal.submittedName());   // persist the name typed in the setup form
            portalSaved = true;
        }
        int ph = !portal.isRunning() ? 2 : (portalSetup ? portalSaved : portal.consented()) ? 1 : 0;
        if (ph != politePhase) { politePhase = ph; drawPoliteScreen(); }
    }
    if (st == ST_SPECTRUM && spLab && spRightPending) {          // RIGHT: short = static/follow, hold ≥500 ms = auto-sweep
        if (buttons.held(Buttons::RIGHT)) {                     // still down — a lone I2C 0xFF read must not count as release
            spRightRel = 0;
            if (!spRightLong && millis() - spRightAt >= 500) { spRightLong = true; spSweepToggle(); }
        } else if (++spRightRel >= 3) {                         // 3 consecutive "up" reads = a real release (glitch-proof)
            if (!spRightLong) spToggleTx();
            spRightPending = false; spRightLong = false; spRightRel = 0;
        }
    }
    if (st == ST_SPECTRUM) spectrumTick();
    if (st == ST_HUNT24) hunt24Tick();
    // Sub-GHz spectrum waterfall
    if (st == ST_SUBSPECTRUM) subTick();
    // Sub-GHz frequency hunter: keep sweeping + peak-holding while shown.
    if (st == ST_SUBHUNT) huntTick();
    // Sub-GHz test transmitter: blast a packet each loop while armed.
    if (st == ST_SUBTX && subTxOn) cc.txBurst();
    // Sub-GHz settings portal: service it; apply the saved settings on submit.
    if (st == ST_SUBCFG) {
        subcfg.loop();
        int ph = !subcfg.isRunning() ? 2 : subcfg.saved() ? 1 : 0;
        if (ph != subCfgPhase) { if (ph >= 1) loadSubCfg(); subCfgPhase = ph; drawSubCfgScreen(); }
    }

    if (millis() > 8000) ota.markHealthy();  // once the UI has clearly been up, confirm this image

    delay(10);
}

#elif DEMO == DEMO_BTNTEST

Buttons buttons;

void setup() {
    Serial.begin(115200);
    delay(300);
    if (!buttons.begin()) {
        Serial.println("[BtnTest] PCF8574 not found on I2C (0x20-0x27).");
        return;
    }
    Serial.printf("[BtnTest] PCF8574 @ 0x%02X. Press one button at a time; I'll print its bit.\n",
                  buttons.addr());
}

void loop() {
    static uint8_t last = 0xFF;
    uint8_t v = buttons.readRaw();
    uint8_t edge = last & ~v;                    // released -> pressed
    for (int b = 0; b < 8; b++) {
        if (edge & (1 << b)) Serial.printf("pressed bit %d  (raw=0x%02X)\n", b, v);
    }
    last = v;
    delay(30);
}

#elif DEMO == DEMO_TOUCHCAL

void setup() {
    Serial.begin(115200);
    delay(300);
    displayInit();
    tft.fillScreen(TFT_BLACK);
    tft.setTextDatum(MC_DATUM);
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.drawString("Touch the arrows", 120, 160, 2);

    uint16_t cal[5];
    tft.calibrateTouch(cal, TFT_WHITE, TFT_BLACK, 18);
    Serial.printf("TOUCH_CAL = { %u, %u, %u, %u, %u };\n",
                  cal[0], cal[1], cal[2], cal[3], cal[4]);

    tft.fillScreen(TFT_BLACK);
    tft.drawString("Done — tap to test", 120, 160, 2);
}

void loop() {
    uint16_t x, y;
    if (tft.getTouch(&x, &y)) {
        tft.fillCircle(x, y, 3, TFT_GREEN);
        Serial.printf("touch %u,%u\n", x, y);
    }
}

#endif
